{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Bản quyền (c) Tập đoàn Microsoft. Bảo lưu mọi quyền.",
		"Được cấp phép theo Giấy phép MIT. Xem License.txt trong thư mục gốc của dự án để biết thông tin về giấy phép.",
		"--------------------------------------------------------------------------------------------",
		"Không chỉnh sửa tệp này. Nó được tạo bằng máy."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"A profiling session is already running, would you like to stop it and start a new session?": "Một phiên lập hồ sơ đang chạy, bạn có muốn dừng phiên này và bắt đầu một phiên mới không?",
			"Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Điều chỉnh (các) mẫu hình cầu trong thuộc tính 'outFiles' để chúng bao phủ JavaScript đã tạo.",
			"Always": "Luôn luôn",
			"Always in this Workspace": "Luôn ở trong không gian làm việc này",
			"An error occurred taking a profile from the target.": "Đã xảy ra lỗi khi lấy một hồ sơ từ mục tiêu.",
			"Animation Frame Fired": "Khung hình hoạt hình được kích hoạt",
			"Assertion failed": "Khẳng định không thành công",
			"Attach to process: '{0}' doesn't look like a process id.": "Đính kèm vào quy trình: '{0}' trông không giống id quy trình.",
			"Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Đính kèm vào quy trình: không thể bật chế độ gỡ lỗi cho quy trình '{0}' ({1}).",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "Thuộc tính 'runtimeVersion' yêu cầu trình quản lý phiên bản Node.js 'nvm-windows' hoặc 'nvs'.",
			"Attribute 'runtimeVersion' requires Node.js version manager 'nvs' or 'nvm' to be installed.": "Thuộc tính 'runtimeVersion' yêu cầu cài đặt trình quản lý phiên bản Node.js 'nvs' hoặc 'nvm'.",
			"Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "Thuộc tính 'runtimeVersion' có hương vị/kiến trúc yêu cầu cài đặt 'nvs'.",
			"Block": "Chặn",
			"Breaks on all throw errors, even if they're caught later.": "Sự gián đoạn của tất cả các lỗi, ngay cả khi nó bị chặn.",
			"Breaks only on errors or promise rejections that are not handled.": "Nó chỉ bị gián đoạn khi nó không phải là lỗi xử lý hoặc hứa hẹn sẽ từ chối.",
			"CPU Profile": "Cấu hình CPU",
			"CPU profile saved as \"{0}\" in your workspace folder": "Cấu hình CPU được lưu dưới dạng \"{0}\" trong thư mục không gian làm việc của bạn",
			"CSP violation \"{0}\"": "Vi phạm CSP\"{0}\"",
			"Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "{1}. Vui lòng đảm bảo rằng Node.js đã được cài đặt và trong PATH của bạn hoặc đặt \"runtimeExecutable\"trong launch.json của bạn",
			"Can't load environment variables from file ({0}).": "Không thể tải biến môi trường từ tệp ({0}).",
			"Cancel Animation Frame": "Hủy khung hoạt hình",
			"Cannot connect to the target at {0}: {1}": "Không thể kết nối với mục tiêu tại {0}: {1}",
			"Cannot find a program to debug": "Không thể tìm thấy chương trình để gỡ lỗi",
			"Cannot launch debug target in terminal ({0}).": "Không thể bắt đầu mục tiêu gỡ lỗi trong thiết bị đầu cuối ({0}).",
			"Cannot restart asynchronous frame": "Không thể khởi động lại khung không đồng bộ",
			"Cannot set an empty value": "Không thể đặt giá trị trống",
			"Catch Block": "Bắt khối",
			"Caught Exceptions": "Ngoại lệ bị chặn",
			"Close AudioContext": "Đóng bối cảnh âm thanh",
			"Closure": "Khép kín",
			"Closure ({0})": "Đóng ({0})",
			"Console profile started": "Đã kích hoạt hồ sơ máy chủ",
			"Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "Không thể kết nối với bất kỳ ống dẫn chế độ xem web UWP nào. Vui lòng đảm bảo rằng chế độ xem web của bạn được lưu trữ ở chế độ gỡ lỗi và 'pipeName' trong 'launch.json' là chính xác.",
			"Could not query the provided object": "Không thể truy vấn đối tượng được cung cấp",
			"Could not read source map for {0}: {1}": "Không thể đọc tệp nguồn cho {0}: {1}",
			"Could not read {0}: {1}": "Không thể đọc {0}: {1}",
			"Create AudioContext": "Tạo bối cảnh âm thanh",
			"Create canvas context": "Xây dựng nội dung canvas",
			"Debug Anyway": "Vẫn đang gỡ lỗi",
			"Debug URL": "Gỡ lỗi URL",
			"Details": "Chi tiết",
			"Don't show again": "Không hiển thị trở lại",
			"Duration": "khoảng thời gian",
			"Duration of Profile": "Thời lượng hồ sơ",
			"Edit package.json": "Chỉnh sửa gói.json",
			"Eval": "Đánh giá",
			"Frame could not be restarted": "Không thể khởi động lại khung",
			"Generates a .cpuprofile file you can open in the Chrome devtools": "Tạo tệp .cpuprofile có thể mở được trong Chrome DevTools",
			"Generates a .heapprofile file you can open in the Chrome devtools": "Tạo tệp .heaprofile có thể mở được trong Chrome DevTools",
			"Generates a .heapsnapshot file you can open in the Chrome devtools": "Tạo tệp .heapsnapshot có thể mở được trong Chrome DevTools",
			"Global": "Toàn cầu",
			"Got it!": "học hỏi!",
			"Heap Profile": "Xếp chồng hồ sơ",
			"Heap Snapshot": "Xếp chồng ảnh chụp nhanh",
			"How long to run the profile:": "Thời lượng thực hiện hồ sơ:",
			"Ignore": "sao nhãng",
			"Invalid expression": "Biểu thức không hợp lệ",
			"Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "Điều kiện đến \"{0}\" không hợp lệ. Một biểu thức như \"> 42\" hoặc \"== 2\" là bắt buộc.",
			"It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Trình duyệt dường như đang chạy từ {0}. Vui lòng đóng trình duyệt trước khi thử gỡ lỗi, nếu không Mã VS có thể không kết nối được với nó.",
			"It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Phiên gỡ lỗi của bạn dường như đã kết thúc. Hãy thử chạy lại trình gỡ lỗi, sau đó thực hiện lệnh \"Gỡ lỗi: Chẩn đoán các vấn đề về điểm ngắt\"",
			"It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "Việc đặt điểm dừng mất một lúc. Bạn có thể tăng tốc mọi thứ bằng cách cập nhật 'outFiles' trong launch.json.",
			"JavaScript Debug Terminal": "Thiết bị đầu cuối gỡ lỗi JavaScript",
			"JavaScript debug adapter": "Bộ điều hợp gỡ lỗi JavaScript",
			"Launch Chrome against localhost": "Khởi chạy Chrome trên máy chủ cục bộ",
			"Launch Edge against localhost": "Khởi chạy Microsoft Edge trên máy chủ cục bộ",
			"Launch Program": "Chương trình khởi chạy",
			"Launch configuration created based on 'package.json'.": "Bắt đầu cấu hình được tạo từ 'package.json",
			"Launch configuration for '{0}' project created.": "Đang bắt đầu cấu hình cho dự án '{0}' đã tạo",
			"Local": "khu vực",
			"Lost connection to debugee, reconnecting in {0}ms\\r\\n": "Kết nối với trình gỡ lỗi đã bị mất. Sẽ kết nối lại sau {0}ms\\r\\n mili giây",
			"Manual": "Thủ công",
			"Module": "Mô-đun",
			"Never": "Không bao giờ",
			"No": "KHÔNG",
			"No npm scripts found in your package.json": "Không tìm thấy tập lệnh npm nào trong gói.json của bạn",
			"No workspace folder open.": "Thư mục không gian làm việc không mở.",
			"Node.js version '{0}' not installed using version manager {1}.": "Đã cài đặt phiên bản Node.js '{0}' với trình quản lý phiên bản {1}.",
			"Not Now": "không phải bây giờ",
			"Only objects can be queried": "Chỉ các đối tượng truy vấn",
			"Open launch.json": "Mở launch.json",
			"Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "Đầu ra đã bị cắt bớt thành {0} ký tự đầu tiên. Thực thi '{1}' để sao chép toàn bộ đầu ra.",
			"Paused": "Đã tạm dừng",
			"Paused before Out Of Memory exception": "Đã tạm dừng trước một ngoại lệ hết bộ nhớ",
			"Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "Đã tạm dừng tại điểm dừng phát hiện vi phạm chính sách bảo mật nội dung, chỉ thị \"{0}\"",
			"Paused on DOM breakpoint": "Tạm dừng tại điểm ngắt DOM",
			"Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "Đã dừng do lỗi kiểm tra sai WebGL, lỗi \"{0}\"",
			"Paused on XMLHttpRequest or fetch": "Đã tạm dừng trên XMLHttpRequest hoặc tìm nạp",
			"Paused on assert": "Tạm dừng trên Lời nhắc phán quyết",
			"Paused on breakpoint": "Tạm dừng tại điểm dừng",
			"Paused on debug() call": "Tạm dừng trong khi gọi gỡ lỗi()",
			"Paused on debugger statement": "Tạm dừng trong tuyên bố trình gỡ lỗi",
			"Paused on event listener": "Đã tạm dừng trong khi trình xử lý sự kiện",
			"Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "Đã tạm dừng tại điểm dừng trình xử lý sự kiện \"{0}\" được kích hoạt bởi \"{1}\"",
			"Paused on exception": "Tạm dừng do ngoại lệ",
			"Paused on frame entry": "Dự án khung bị tạm dừng",
			"Paused on instrumentation breakpoint": "Đã tạm dừng khi phát hiện điểm dừng",
			"Paused on instrumentation breakpoint \"{0}\"": "Đã tạm dừng khi kiểm tra điểm dừng \"{0}\"",
			"Paused on promise rejection": "Tạm dừng khi từ chối lời hứa",
			"Pick Breakpoint": "Chọn điểm ngắt",
			"Pick the node.js process to attach to": "Chọn trình xử lý node.js đích bổ sung",
			"Please enter a number": "Vui lòng nhập số",
			"Please enter a number greater than 1": "Vui lòng nhập số lớn hơn 1",
			"Please stop the running profile before starting a new one.": "Vui lòng dừng cấu hình đang chạy trước khi bắt đầu một cấu hình mới.",
			"Process picker failed ({0})": "Không thể xử lý bộ chọn trình tự ({0})",
			"Profile duration in seconds, e.g \"5\"": "Thời lượng hồ sơ tính bằng giây, ví dụ \"5\"",
			"Profiling": "phân tích",
			"Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "Việc lập hồ sơ với các điểm ngắt được bật có thể gây ra những thay đổi về hiệu suất mã của bạn. Bạn có thể sử dụng các điều kiện Thời lượng hoặc Kết thúc thủ công để xác minh các quan sát của mình.",
			"Read More": "đọc thêm",
			"Request Animation Frame": "Yêu cầu khung hình động",
			"Resume AudioContext": "Tiếp tục ngữ cảnh âm thanh",
			"Return value": "giá trị trả về",
			"Run Current File": "Thực thi tệp hiện tại",
			"Run Script: {0}": "Mã lệnh thực thi: {0}",
			"Run for a specific amount of time": "Thực hiện trong một khoảng thời gian cụ thể",
			"Run until a specific breakpoint is hit": "Thực hiện cho đến khi đạt đến một điểm dừng cụ thể",
			"Run until manually stopped": "Khi thực hiện dừng thủ công",
			"Saving": "Đang lưu",
			"Script": "Mã lệnh",
			"Script Blocked by Content Security Policy": "Tập lệnh bị cấm theo Nguyên tắc bảo mật nội dung",
			"Script First Statement": "Câu lệnh đầu tiên trong tập lệnh",
			"Select a tab": "Chọn thẻ chỉ mục",
			"Select current working directory for new terminal": "Chọn thư mục làm việc hiện tại cho thiết bị đầu cuối mới",
			"Select the page where you want to open the devtools": "Chọn một trang để mở Devtools",
			"Select the session you want to inspect:": "Chọn phiên bạn muốn kiểm tra:",
			"Set innerHTML": "Đặt HTML bên trong",
			"Skipped by skipFiles": "Skipfiles bị bỏ qua",
			"Skipped by smartStep": "smartStep đã bỏ qua",
			"Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Một số điểm ngắt có thể không hoạt động trong phiên bản Node.js của bạn. Bạn nên nâng cấp để nhận các bản sửa lỗi, hiệu suất và bảo mật mới nhất. Chi tiết: https://aka.ms/AAcsvqm",
			"Source not a source map": "Tệp gốc không tương ứng với tệp gốc",
			"Source not found": "Không tìm thấy tệp gốc",
			"Stack frame not found": "Không thể tìm thấy khung xếp chồng",
			"Starting profile...": "Đang khởi chạy hồ sơ...",
			"Stopping profile...": "Dừng hồ sơ...",
			"Suspend AudioContext": "Tạm dừng ngữ cảnh âm thanh",
			"Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Lỗi cú pháp khi đặt điểm dừng với điều kiện {0} tại dòng {1}: {2}",
			"Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "Không thể tìm thấy trang mục tiêu. Bạn phải cập nhật \"urlFilter\" để tìm trang mà bạn đang cố gắng gỡ lỗi.",
			"The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "Phiên bản của Nút trong \"{0}\" đã lỗi thời (phiên bản {1}). Nút 8.x là yêu cầu tối thiểu.",
			"The URL provided is invalid": "URL đã cung cấp không hợp lệ",
			"The configured `cwd` {0} does not exist.": "Tập hợp 'cwd' {0} không tồn tại",
			"The configured `cwd` {0} is not a folder.": "'cwd' {0} được chỉ định không phải là một thư mục.",
			"This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Đây là đường dẫn đến tệp bị thiếu được tham chiếu bởi bản đồ nguồn. Thay vào đó, bạn có muốn gỡ lỗi phiên bản đã biên dịch không?",
			"Thread is not paused": "Chủ đề không bị treo",
			"Thread is not paused on exception": "Chuỗi không bị tạm ngừng do ngoại lệ",
			"Thread not found": "Không thể tìm thấy chủ đề",
			"Type of profile:": "Loại hồ sơ:",
			"UWP webview debugging is not available on your platform.": "Gỡ lỗi Chế độ xem web UWP không khả dụng cho nền tảng của bạn",
			"Unable to attach to browser": "Không thể kết nối với trình duyệt",
			"Unable to evaluate": "Không thể đánh giá",
			"Unable to evaluate on async stack frame": "Không thể đánh giá các khung xếp chồng lên nhau không đồng bộ",
			"Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "Không thể tìm thấy cài đặt trình duyệt trên hệ thống của bạn. Vui lòng thử cài đặt dự án hoặc cung cấp đường dẫn tuyệt đối của trình duyệt trong \"runtimeExecutable\" trong launch.json của bạn.",
			"Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "Không thể tìm thấy phiên bản {0} {1}. Phiên bản tự động phát hiện được cung cấp: {2}. Bạn có thể đặt \"runtimeExecutable\" trong launch.json của mình thành một trong số chúng hoặc cung cấp cho trình duyệt đường dẫn tuyệt đối đến tệp thực thi .",
			"Unable to launch browser: \"{0}\"": "Không thể khởi động trình duyệt: \"{0}\"",
			"Unable to pause": "không thể tạm dừng",
			"Unable to pretty print": "Không thể làm đẹp bức ảnh",
			"Unable to resume": "Không thể tiêp tục",
			"Unable to retrieve source content": "Không thể truy xuất nội dung tệp thô",
			"Unable to set variable value": "Không thể đặt giá trị biến",
			"Unable to step in": "Không thể bước qua",
			"Unable to step next": "Không thể tiếp tục đến dòng tiếp theo",
			"Unable to step out": "Không thể nhảy ra ngoài",
			"Unbound breakpoint": "Điểm ngắt không liên kết",
			"Uncaught Exceptions": "Ngoại lệ không bị chặn",
			"Unknown error": "Lỗi không rõ",
			"Variable not found": "Không tìm thấy biến",
			"Variables not available in async stacks": "Các biến không thể được sử dụng trong ngăn xếp không đồng bộ",
			"WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "Cảnh báo: Mất hơn {1} mili giây để xử lý nguồn {0}, vì vậy hãy tiếp tục thực thi mà không đợi tất cả các điểm dừng trong tập lệnh hoàn tất cài đặt.",
			"We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "Không thể khởi chạy trình duyệt từ trang này khi đang ở chế độ gỡ lỗi. Để gỡ lỗi trang này, hãy mở không gian làm việc này từ bên trong Mã VS trên màn hình của bạn.",
			"We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "Không thể khởi chạy trình duyệt từ đây khi đang ở chế độ gỡ lỗi. Vui lòng mở không gian làm việc này từ Mã VS trên máy tính để bàn của bạn để bật gỡ lỗi.",
			"WebGL Error Fired": "Đã xảy ra lỗi WebGL",
			"WebGL Warning Fired": "Cảnh báo WebGL đã được đưa ra",
			"With Block": "Có khối",
			"Would you like to save a configuration in your launch.json for easy access later?": "Bạn có muốn lưu cài đặt trong launch.json của mình để truy cập sau này không?",
			"Yes": "Đúng",
			"You need to open a workspace folder to debug npm scripts.": "Bạn cần mở thư mục không gian làm việc để gỡ lỗi tập lệnh npm.",
			"You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Bạn đang chạy phiên bản Node.js lỗi thời. Chúng tôi khuyên bạn nên nâng cấp để khắc phục các lỗi, vấn đề về hiệu suất và bảo mật mới nhất.",
			"an old debug session": "Phiên gỡ lỗi cũ",
			"path does not exist": "Đường dẫn không tồn tại",
			"process id: {0} ({1})": "Id bộ xử lý: {0} ({1})",
			"process id: {0}, debug port: {1} ({2})": "Id trình xử lý: {0}, cổng gỡ lỗi: {1} ({2})",
			"setInterval fired": "setInterval đã được nâng lên",
			"setTimeout fired": "setTimeout đã được nâng lên",
			"the configured userDataDir": "Đặt userDataDir",
			"{0} (couldn't describe: {1})": "{0} (không thể mô tả: {1})",
			"{0} Click to Stop Profiling": "{0} nhấp để dừng phân tích",
			"{0} Click to Stop Profiling ({1} sessions)": "{0} lần nhấp để dừng phân tích ({1} phiên)",
			"{0} Click to Stop Profiling ({1})": "{0} nhấp để dừng phân tích ({1})"
		},
		"package": {
			"add.browser.breakpoint": "Thêm điểm dừng trình duyệt",
			"attach.node.process": "Liên kết tới trình xử lý nút",
			"base.cascadeTerminateToConfigurations.label": "Khi phiên gỡ lỗi này kết thúc, danh sách các phiên gỡ lỗi cũng sẽ bị dừng.",
			"browser.address.description": "Đã phát hiện thấy địa chỉ IP hoặc tên máy chủ mà trình duyệt đang nghe.",
			"browser.attach.port.description": "Cổng được sử dụng để gỡ lỗi trình duyệt từ xa, được chỉ định là `--remote-debugging-port` khi khởi động trình duyệt.",
			"browser.baseUrl.description": "URL cơ sở được sử dụng để giải quyết đường dẫn baseUrl. baseURL bị cắt bớt khi ánh xạ URL tới một tệp trên đĩa. Mặc định là miền URL khởi động.",
			"browser.browserAttachLocation.description": "Buộc trình duyệt đính kèm vào một vị trí. Trong không gian làm việc từ xa (ví dụ: thông qua SSH hoặc WSL), điều này có thể được sử dụng để đính kèm vào trình duyệt trên máy tính từ xa thay vì đính kèm cục bộ.",
			"browser.browserLaunchLocation.description": "Buộc trình duyệt khởi động tại một vị trí. Trong không gian làm việc từ xa (ví dụ: qua ssh hoặc WSL), điều này có thể được sử dụng để khởi động trình duyệt trên máy tính từ xa thay vì máy cục bộ.",
			"browser.cleanUp.description": "Dọn dẹp để thực hiện sau khi phiên gỡ lỗi hoàn tất. Chỉ đóng tab chỉ mục đang được gỡ lỗi so với đóng toàn bộ trình duyệt.",
			"browser.cwd.description": "Thư mục làm việc tùy chọn cho các tệp thực thi trong quá trình thực thi",
			"browser.disableNetworkCache.description": "Kiểm soát xem có bỏ qua bộ nhớ đệm mạng đối với mọi yêu cầu hay không",
			"browser.env.description": "Từ điển tùy chọn của nhóm khóa/giá trị chỉ mục môi trường trình duyệt",
			"browser.file.description": "Tệp html cục bộ để mở trong trình duyệt",
			"browser.includeDefaultArgs.description": "Liệu các đối số khởi động trình duyệt mặc định có được đưa vào khi khởi động hay không (để tắt các tính năng có thể khiến việc gỡ lỗi trở nên khó khăn hơn).",
			"browser.includeLaunchArgs.description": "Nâng cao: Có đặt bất kỳ đối số khởi động/gỡ lỗi mặc định nào trên trình duyệt hay không. Công cụ gỡ lỗi sẽ cho rằng trình duyệt sẽ sử dụng gỡ lỗi đường ống, chẳng hạn như sử dụng đường ống được cung cấp bởi `--remote-debugging-pipe` .",
			"browser.inspectUri.description": "Định dạng để ghi đè thanh traUri: Đây là chuỗi mẫu để chèn các khóa chỉ mục trong `{curlyBraces}`. Các khóa chỉ mục khả dụng là:\r\n - `url.*` là ứng dụng hiện đang thực thi được phân tích cú pháp Các địa chỉ tiếp theo. Ví dụ: ` {url.port}`, `{url.hostname}`\r\n - `port` là cổng gỡ lỗi mà Chrome đang lắng nghe.\r\n - `browserInspectUri` là URI Trình kiểm tra được bật trên trình duyệt.\r\n - `browserInspectUriPath` là phần đường dẫn của URI trình kiểm tra trên trình duyệt đang được khởi chạy (ví dụ: \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2 \").\r\n - `wsProtocol ` là giao thức WebSocket được đề xuất. Nếu URL nguồn là `https`, mục này sẽ được đặt thành `wss`; nếu không phải là `https`, nó sẽ được đặt thành `ws`. \r\n",
			"browser.launch.port.description": "Cổng mà trình duyệt lắng nghe. Mặc định là \"0\", cổng này sẽ gỡ lỗi trình duyệt thông qua một đường ống. Đây thường là tùy chọn được đề xuất an toàn hơn trừ khi bạn cần kết nối với trình duyệt thông qua các công cụ khác.",
			"browser.pathMapping.description": "Việc ánh xạ URL/đường dẫn tới thư mục cục bộ có thể phân giải mã tập lệnh trong trình duyệt thành mã tập lệnh trên đĩa",
			"browser.perScriptSourcemaps.description": "Có sử dụng tập lệnh tải riêng lẻ bản đồ nguồn duy nhất có chứa tên tệp chính của tệp nguồn hay không. Điều này có thể được đặt để tối ưu hóa quá trình xử lý bản đồ nguồn khi xử lý số lượng lớn tập lệnh nhỏ. Nếu được đặt thành 'tự động', chúng tôi sẽ phát hiện các trường hợp đã biết bên dưới.",
			"browser.profileStartup.description": "Nếu đúng, quá trình phân tích sẽ bắt đầu ngay sau khi trình xử lý bắt đầu",
			"browser.restart": "Có kết nối lại khi kết nối trình duyệt bị ngắt",
			"browser.revealPage": "Tab chỉ mục tiêu điểm",
			"browser.runtimeArgs.description": "Các đối số tùy chọn được chuyển đến tệp thực thi trong giai đoạn chạy.",
			"browser.runtimeExecutable.description": "'canary', 'stable', 'custom' hoặc đường dẫn đến tệp thực thi của trình duyệt. Custom có ​​nghĩa là trình bao bọc tùy chỉnh, thành phần tùy chỉnh hoặc biến môi trường CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "'canary', 'stable', 'dev', 'custom' hoặc đường dẫn đến tệp thực thi của trình duyệt. Custom đại diện cho trình bao bọc tùy chỉnh, thành phần tùy chỉnh hoặc biến môi trường EDGE_PATH.",
			"browser.server.description": "Đặt máy chủ web khởi động. Sẽ sử dụng cấu hình giống như khởi động 'nút'.",
			"browser.skipFiles.description": "Mảng hoặc đường dẫn toàn cầu của tên tệp hoặc thư mục cần bỏ qua khi gỡ lỗi. Cho phép các mẫu dấu hoa thị và phủ định, ví dụ: `[\"**/node_modules/**\",\"!**/node_modules/my-module /* *\"]`",
			"browser.smartStep.description": "Tự động chuyển qua các dòng không tương ứng với tệp sơ đồ nguồn. Ví dụ: TypeScript tự động tạo mã khi biên dịch async/await hoặc các chức năng khác.",
			"browser.sourceMapPathOverrides.description": "Một tập hợp ánh xạ được sử dụng để ghi lại vị trí tệp nguồn được hiển thị trong sơ đồ nguồn sang vị trí trên đĩa của nó. Xem Đọc tệp của tôi để biết chi tiết.",
			"browser.sourceMapRenames.description": "Có nên sử dụng bản đồ \"names\" trong bản đồ nguồn hay không. Điều này yêu cầu nội dung nguồn, vì vậy tốc độ có thể bị chậm lại bởi một số công cụ gỡ lỗi.",
			"browser.sourceMaps.description": "Sử dụng bản đồ gốc JavaScript (nếu có).",
			"browser.targetSelection": "Có nối thêm vào tất cả các mục tiêu khớp với bộ lọc URL (\"tự động\") hay yêu cầu bạn chọn một mục tiêu (\"chọn\").",
			"browser.timeout.description": "Thử lại số mili giây này để kết nối với trình duyệt. Mặc định là 10000 mili giây.",
			"browser.url.description": "Thẻ chỉ mục có URL rõ ràng này sẽ được tìm kiếm và thêm vào nếu tìm thấy",
			"browser.urlFilter.description": "Một trang có URL này sẽ được tìm kiếm và, nếu được tìm thấy, sẽ được thêm vào trang đó. * ký tự đại diện được cho phép.",
			"browser.userDataDir.description": "Theo mặc định, trình duyệt bắt đầu với một hồ sơ người dùng riêng biệt trong thư mục tạm thời. Sử dụng tùy chọn này để ghi đè nó. Đặt thành Sai để bắt đầu với hồ sơ người dùng mặc định của bạn. Nếu phiên bản được khởi chạy từ ` userDataDir` được thực thi, không thể bắt đầu một trình duyệt mới.",
			"browser.vueComponentPaths": "Danh sách tệp kiểu toàn cầu để tìm kiếm các thành phần '*.vue'. Theo mặc định, toàn bộ không gian làm việc được tìm kiếm. Vì sơ đồ nguồn của Vue là bắt buộc để thực hiện tra cứu bổ sung trong Vue CLI 4, danh sách này phải được đặt. Chỉ cần đặt danh sách này vào một mảng trống để tắt tính năng xử lý đặc biệt này.",
			"browser.webRoot.description": "Điều này chỉ định đường dẫn không gian làm việc tuyệt đối tới thư mục gốc của máy chủ web. Có thể được sử dụng để phân giải các đường dẫn như `/app.js` tới các tệp trên đĩa. Ngoài ra \"/\" viết tắt của ánh xạ đường dẫn",
			"chrome.attach.description": "Đính kèm vào phiên bản Chrome đã chuyển sang chế độ gỡ lỗi",
			"chrome.attach.label": "Chrome: liên kết",
			"chrome.label": "Web Ứng dụng web (Chrome)",
			"chrome.launch.description": "Khởi động Chrome để gỡ lỗi URL",
			"chrome.launch.label": "Chrome: bắt đầu",
			"commands.callersAdd.label": "Loại trừ người gọi",
			"commands.callersAdd.paletteLabel": "Loại trừ người gọi bị tạm dừng ở vị trí hiện tại",
			"commands.callersGoToCaller.label": "Đi tới vị trí người gọi",
			"commands.callersGoToTarget.label": "Chuyển đến vị trí mục tiêu",
			"commands.callersRemove.label": "Xóa người gọi bị loại trừ",
			"commands.callersRemoveAll.label": "Xóa tất cả người gọi bị loại trừ",
			"commands.disableSourceMapStepping.label": "Nguồn hủy kích hoạt tương ứng với thực thi từng bước",
			"commands.enableSourceMapStepping.label": "Bật ánh xạ nguồn từng bước",
			"configuration.autoAttachMode": "Định cấu hình quy trình nào sẽ tự động đính kèm và gỡ lỗi khi bật `#debug.node.autoAttach#`. Một quy trình Node được khởi chạy với cờ `--inspect` sẽ luôn được đính kèm, bất kể cài đặt này là gì.",
			"configuration.autoAttachMode.always": "Tự động gắn vào mọi quy trình Node.js bắt đầu trong thiết bị đầu cuối.",
			"configuration.autoAttachMode.disabled": "Tự động thêm bị tắt và không được hiển thị trong cột trạng thái.",
			"configuration.autoAttachMode.explicit": "Chỉ được thêm tự động nếu `--inspect` được chỉ định.",
			"configuration.autoAttachMode.smart": "Tự động nối thêm khi thực thi tập lệnh không có trong thư mục node_modules.",
			"configuration.autoAttachSmartPatterns": "Đặt mẫu hình cầu để xác định thời điểm đính kèm theo mẫu `#debug.javascript.autoAttachFilter#`' thông minh. Đã thay thế `$KNOWN_TOOLS$` bằng một danh sách các tên trình chạy mã và thử nghiệm phổ biến. [Đọc thêm trong tài liệu VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-potypes).",
			"configuration.automaticallyTunnelRemoteServer": "Khi phát hiện các ứng dụng web từ xa, hãy đặt có tự động mở kênh từ máy chủ từ xa đến máy tính cục bộ hay không.",
			"configuration.breakOnConditionalError": "Có nên dừng khi điểm dừng có điều kiện đưa ra lỗi hay không.",
			"configuration.debugByLinkOptions": "Tùy chọn sử dụng khi nhấp vào liên kết mở gỡ lỗi trong thiết bị đầu cuối gỡ lỗi. Có thể được đặt thành \"false\" để tắt hành vi này.",
			"configuration.defaultRuntimeExecutables": "`runtimeExecutable` mặc định cho cài đặt khởi động (nếu không được chỉ định). Nó có thể được sử dụng để đặt đường dẫn tùy chỉnh cho cài đặt Node.js hoặc trình duyệt.",
			"configuration.npmScriptLensLocation": "\"Run\" và \"Gỡ lỗi\" sẽ xuất hiện trong tập lệnh npm của bạn. Có thể là 'tất cả', tập lệnh, 'đầu' của phần tập lệnh hoặc 'không bao giờ'. ",
			"configuration.pickAndAttachOptions": "Tùy chọn mặc định để sử dụng khi gỡ lỗi một quy trình thông qua lệnh `Debug: Attach to Node.js Process`",
			"configuration.resourceRequestOptions": "Yêu cầu tùy chọn để sử dụng khi tải tài nguyên (chẳng hạn như bản đồ nguồn) trong trình gỡ lỗi. Ví dụ: bạn có thể cần đặt tùy chọn này nếu bản đồ nguồn của bạn yêu cầu xác thực hoặc sử dụng chứng chỉ tự ký. Có thể sử dụng tùy chọn để sử dụng [ `got` ](https://github.com/sindresorhus/got) để tạo yêu cầu.\r\n\r\nTắt xác thực thông tin xác thực là một trường hợp phổ biến và có thể được thực hiện bằng cách chuyển `{ \"https\" : { \" rejectUnauthorized\": false } }` để hoàn thành.",
			"configuration.terminalOptions": "Tùy chọn khởi chạy mặc định cho thiết bị đầu cuối gỡ lỗi JavaScript và tập lệnh npm.",
			"configuration.unmapMissingSources": "Đặt xem các tệp bản đồ nguồn không thể đọc tệp gốc có được tự động hủy ánh xạ hay không. Nếu sai (mặc định), một lời nhắc sẽ được hiển thị.",
			"createDiagnostics.label": "Chẩn đoán các vấn đề về điểm ngắt",
			"customDescriptionGenerator.description": "Tùy chỉnh mô tả văn bản được công cụ sửa lỗi hiển thị cho các đối tượng (chẳng hạn như biến cục bộ, v.v.). Ví dụ:\r\n 1. this.toString() // sẽ gọi toString để in tất cả các đối tượng\r\n 2 . this.customDescription ? this.customDescription() : defaultValue // Sử dụng phương thức customDescription (nếu có), nếu không trả về defaultValue\r\n 3. Hàm (def) { return this.customDescription ? this.customDescription() : def } // Sử dụng phương thức customDescription (nếu có), nếu không trả về defaultValue\r\n       ",
			"customPropertiesGenerator.description": "Trong công cụ gỡ lỗi tùy chỉnh, các thuộc tính (biến cục bộ, v.v.) được hiển thị cho đối tượng. Ví dụ:\r\n 1. { ...this, extraProperty: '12345' } // Thêm extraProperty 12345 vào tất cả Object\r\n 2. this.customProperties ? this.customProperties() : this // Sử dụng phương thức customProperties (nếu có), nếu không thể sử dụng phương thức này, vui lòng sử dụng các thuộc tính tại đây (thuộc tính mặc định)\r\n3 .function () { return this.customProperties ? this.customProperties() : this } // Sử dụng phương thức customDescrip (nếu có); nếu không thể sử dụng phương thức này, hãy trả về thuộc tính mặc định\r\n\r\nĐã lỗi thời: Đây là cách thức hoạt động của tính năng này tạm thời cho đến khi chúng tôi có thời gian triển khai nó theo cách được mô tả tại đây: https://github.com/microsoft/vscode/issues/102181 (tiếng Anh)",
			"debug.npm.edit": "Chỉnh sửa gói.json",
			"debug.npm.noScripts": "Không tìm thấy tập lệnh npm nào trong gói.json của bạn",
			"debug.npm.noWorkspaceFolder": "Bạn cần mở thư mục không gian làm việc để gỡ lỗi tập lệnh npm.",
			"debug.npm.parseError": "Không thể đọc {0}: {1}",
			"debug.npm.script": "Gỡ lỗi tập lệnh npm",
			"debug.terminal.attach": "Đính kèm với trình xử lý thiết bị đầu cuối Node.js",
			"debug.terminal.label": "Thiết bị đầu cuối gỡ lỗi JavaScript",
			"debug.terminal.program.description": "Lệnh thực thi khi khởi động thiết bị đầu cuối. Nếu không được cung cấp, thiết bị đầu cuối sẽ không khởi động chương trình khi khởi động.",
			"debug.terminal.snippet.label": "Thực thi \"npm start\" trong thiết bị đầu cuối gỡ lỗi",
			"debug.terminal.toggleAuto": "Chuyển đổi tự động đính kèm Node.js đầu cuối",
			"debug.terminal.welcome": "[Thiết bị đầu cuối trình gỡ lỗi JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nBạn có thể sử dụng Thiết bị đầu cuối trình gỡ lỗi JavaScript để gỡ lỗi các quy trình Node.js được thực thi trên dòng lệnh",
			"debug.terminal.welcomeWithLink": "[Thiết bị đầu cuối trình gỡ lỗi JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nBạn có thể sử dụng Thiết bị đầu cuối trình gỡ lỗi JavaScript để gỡ lỗi các quy trình Node.js được thực thi trên dòng lệnh. \r\n\r\n[URL gỡ lỗi](lệnh:extension.js-debug.debugLink)",
			"debug.unverifiedBreakpoints": "Không thể đặt một số điểm ngắt. Nếu gặp sự cố, bạn có thể [khắc phục sự cố cài đặt khởi động](command:extension.js-debug.createDiagnostics).",
			"debugLink.label": "Mở liên kết",
			"edge.address.description": "Địa chỉ IP hoặc tên máy chủ mà chế độ xem web lắng nghe khi gỡ lỗi. Nếu không được đặt, địa chỉ này sẽ được tự động phát hiện.",
			"edge.attach.description": "Đính kèm với phiên bản Microsoft Edge đã vào chế độ gỡ lỗi",
			"edge.attach.label": "Edge: Liên kết",
			"edge.label": "Web Ứng dụng web (Edge)",
			"edge.launch.description": "Khởi chạy Microsoft Edge để gỡ lỗi URL",
			"edge.launch.label": "Edge: bắt đầu",
			"edge.port.description": "Cổng mà trình gỡ lỗi WebView lắng nghe khi gỡ lỗi WebView. Nếu không được đặt, cổng này sẽ được tự động phát hiện.",
			"edge.useWebView.attach.description": "Đối tượng chứa 'tên đường ống 'của ống UWP của WebView2.Đây là đường ống thành lập \"\\\\.\\pipe\\LOCAL\\MyTestSharedMemory\" Thời gian \"MyTestSharedMemory\"",
			"edge.useWebView.launch.description": "Khi 'đúng', trình gỡ lỗi sẽ coi tệp thực thi trong thời gian chạy là ứng dụng máy chủ chứa WebView, cho phép bạn gỡ lỗi nội dung tập lệnh WebView.",
			"enableContentValidation.description": "bật/tắt xem có xác minh rằng nội dung của tệp trên đĩa khớp với nội dung được tải trong thời gian chạy hay không. Điều này áp dụng cho nhiều tình huống và cần thiết trong một số trường hợp, nhưng chẳng hạn nếu bạn có chuyển đổi phía máy chủ, nó có thể gây ra sự cố .",
			"errors.timeout": "{0}: hết thời gian chờ sau {1} mili giây",
			"extension.description": "Tiện ích mở rộng để gỡ lỗi các ứng dụng Node.js và Chrome.",
			"extensionHost.label": "Phát triển mô-đun mở rộng Mã VS",
			"extensionHost.launch.config.name": "Bắt đầu mô-đun mở rộng",
			"extensionHost.launch.debugWebWorkerHost": "Đặt xem có nên cố gắng đính kèm vào máy chủ tiện ích mở rộng công việc nền web hay không.",
			"extensionHost.launch.debugWebviews": "Đặt xem có thử đính kèm vào chế độ xem web trong phiên bản Mã VS đã khởi chạy hay không. Điều này chỉ áp dụng cho Mã VS máy tính để bàn.",
			"extensionHost.launch.env.description": "Các biến môi trường được chuyển đến máy chủ mod tiện ích.",
			"extensionHost.launch.rendererDebugOptions": "Các tùy chọn khởi chạy Chrome sẽ sử dụng khi đính kèm vào trình xử lý bộ chuyển mã, bao gồm `debugWebviews` hoặc `debugWebWorkerHost`.",
			"extensionHost.launch.runtimeExecutable.description": "Đường dẫn tuyệt đối đến Mã VS.",
			"extensionHost.launch.stopOnEntry.description": "Tự động dừng máy chủ mô-đun mở rộng sau khi khởi động",
			"extensionHost.snippet.launch.description": "Bắt đầu phần mở rộng mã VS ở chế độ gỡ lỗi",
			"extensionHost.snippet.launch.label": "Phát triển mô-đun mở rộng Mã VS",
			"getDiagnosticLogs.label": "Lưu trữ nhật ký gỡ lỗi JS chẩn đoán",
			"longPredictionWarning.disable": "Không hiển thị trở lại",
			"longPredictionWarning.message": "Việc đặt điểm dừng mất một lúc. Bạn có thể tăng tốc mọi thứ bằng cách cập nhật 'outFiles' trong launch.json.",
			"longPredictionWarning.noFolder": "Thư mục không gian làm việc không mở.",
			"longPredictionWarning.open": "Mở launch.json",
			"node.address.description": "Địa chỉ TCP/IP của chương trình để gỡ lỗi. Mặc định là 'localhost'.",
			"node.attach.attachExistingChildren.description": "Bạn có muốn thử đính kèm vào một quy trình con được sinh ra không.",
			"node.attach.attachSpawnedProcesses.description": "Có nên đặt biến môi trường trong trình xử lý bổ sung để theo dõi con cái đã sinh ra hay không.",
			"node.attach.config.name": "Liên kết",
			"node.attach.continueOnAttach": "Nếu đúng, chúng tôi sẽ tự động tiếp tục chương trình đã bắt đầu và đợi `--inspect-brk`",
			"node.attach.processId.description": "Định danh của trình xử lý để liên kết tới.",
			"node.attach.restart.description": "Khi mất kết nối, hãy thử kết nối lại với chương trình. Nếu được đặt thành 'true', chương trình sẽ thử mỗi giây một lần mà không bị gián đoạn. Bạn có thể chỉ định 'độ trễ' và 'maxAttempts' trong đối tượng để tùy chỉnh khoảng thời gian và số nỗ lực tối đa.",    
			"node.attachSimplePort.description": "Nếu được đặt, hãy gắn vào trình xử lý thông qua cổng đã chỉ định. Các chương trình Node.js thường không cần cài đặt này và không thể gỡ lỗi trình xử lý con, nhưng trong các trường hợp đặc biệt hơn (chẳng hạn như khởi động Deno và Docker), có thể hữu ích. Nếu được đặt thành 0, một cổng ngẫu nhiên được chọn và --inspect-brk tự động được thêm vào đối số khởi động.",
			"node.console.title": "Bảng điều khiển gỡ lỗi nút",
			"node.disableOptimisticBPs.description": "Không đặt điểm ngắt trong bất kỳ tệp nào trước khi tải sơ đồ nguồn cho tệp đó.",
			"node.enableTurboSourcemaps.description": "Đặt xem có sử dụng cơ chế mới nhanh hơn để khám phá ánh xạ nguồn hay không",
			"node.killBehavior.description": "設定當工作階段停止時，如何終止偵錯處理序。可設定為:\r\n\r\n- 強制 (預設): 強制卸除處理序樹狀結構。在 posix 上請傳送 SIGKILL，在 Windows 上請傳送 `taskkill.exe /F`。\r\n- 正常: 適當地卸除處理序樹狀結構。以此方式關機之後，行為不當的處理序有可能仍會持續執行。在 posix 上請傳送 SIGTERM，在 Windows 上則請傳送不指定 `/F` (強制) 旗標的 `taskkill.exe`。\r\n- 無: 不發生任何終止。",
			"node.label": "Nút. js",
			"node.launch.args.description": "Các đối số dòng lệnh được chuyển đến chương trình.\r\n\r\nCó thể là một chuỗi các chuỗi hoặc một chuỗi đơn. Việc đặt thuộc tính này thành một chuỗi sẽ khiến giao diện lệnh đối số không được thoát.",
			"node.launch.autoAttachChildProcesses.description": "Tự động đính kèm công cụ gỡ lỗi vào quy trình con mới.",
			"node.launch.config.name": "khởi động",
			"node.launch.console.description": "Vị trí của mục tiêu để bắt đầu gỡ lỗi.",
			"node.launch.console.externalTerminal.description": "Các thiết bị đầu cuối bên ngoài có thể được định cấu hình thông qua cài đặt người dùng.",
			"node.launch.console.integratedTerminal.description": "Thiết bị đầu cuối tích hợp cho Mã VS",
			"node.launch.console.internalConsole.description": "Bảng điều khiển gỡ lỗi mã VS (Không thể đọc đầu vào từ chương trình)",
			"node.launch.cwd.description": "Đường dẫn tuyệt đối của thư mục làm việc của chương trình đang được gỡ lỗi. Nếu bạn đã đặt localRoot, cwd sẽ so sánh với giá trị này, nếu không, nó sẽ quay trở lại thư mục không gian làm việc của bạn",
			"node.launch.env.description": "Biến môi trường được truyền cho chương trình. Giá trị 'null' sẽ loại bỏ biến khỏi môi trường.",
			"node.launch.envFile.description": "Đường dẫn tuyệt đối tới tệp chứa định nghĩa biến môi trường.",
			"node.launch.logging": "Cài đặt bản ghi",
			"node.launch.logging.cdp": "Đường dẫn tệp nhật ký cho thông báo Giao thức DevTools của Chrome",
			"node.launch.logging.dap": "Đường dẫn tệp nhật ký cho thông báo giao thức bộ điều hợp gỡ lỗi",
			"node.launch.outputCapture.description": "Nguồn để tìm nạp đầu ra từ: nếu được đặt thành `console`, thì API gỡ lỗi mặc định; nếu được đặt thành `std`, thì đó là luồng thiết bị xuất chuẩn/thiết bị xuất chuẩn.",
			"node.launch.program.description": "Đường dẫn tuyệt đối đến gói. Đoán bằng cách xem pack.json và mở tệp.",
			"node.launch.restart.description": "Nếu chương trình kết thúc với mã kết thúc khác không, hãy thử khởi động lại chương trình.",
			"node.launch.runtimeArgs.description": "Các đối số tùy chọn được chuyển đến tệp thực thi trong giai đoạn chạy.",
			"node.launch.runtimeExecutable.description": "Giai đoạn thực thi để sử dụng. Có thể là một đường dẫn tuyệt đối hoặc tên của giai đoạn thực thi có sẵn trên PATH. Nếu bị bỏ qua, `nút` được giả định.",
			"node.launch.runtimeSourcemapPausePatterns": "Chèn thủ công danh sách các mẫu cho các điểm dừng của điểm vào. Điều này hữu ích khi sử dụng các sơ đồ nguồn không tồn tại hoặc không thể phát hiện được trước khi khởi động, cho phép các công cụ gỡ lỗi đặt các điểm ngắt, chẳng hạn như [sử dụng kiến ​​trúc không có máy chủ]( https:/ /github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Giai đoạn thực thi của phiên bản 'nút' đang được sử dụng. Yêu cầu `nvm`.",
			"node.launch.useWSL.deprecation": "'useWSL' không được dùng nữa và hỗ trợ của nó sẽ bị hủy bỏ. Vui lòng sử dụng tiện ích mở rộng 'Từ xa - WSL' để thay thế.",
			"node.launch.useWSL.description": "Sử dụng Hệ thống con Windows cho Linux",
			"node.localRoot.description": "Đường dẫn đến thư mục cục bộ chứa chương trình.",
			"node.pauseForSourceMap.description": "Có phải đợi từng nguồn tập lệnh được liên kết được tải tương ứng hay không. Điều này có chi phí hoạt động và an toàn để vô hiệu hóa khi thực thi trên đĩa miễn là `rootPath` không bị vô hiệu hóa.",
			"node.port.description": "Cổng kết nối để gỡ lỗi. Mặc định là 9229",
			"node.processattach.config.name": "Liên kết đến trình xử lý",
			"node.profileStartup.description": "Đường dẫn tuyệt đối đến thư mục từ xa chứa chương trình.",
			"node.remoteRoot.description": "Liên kết đến trình xử lý",
			"node.resolveSourceMapLocations.description": "Danh sách các mẫu so khớp nhỏ cho các vị trí (thư mục và URL) nơi ánh xạ nguồn có thể được sử dụng để phân tích cú pháp các tệp cục bộ. Bạn có thể sử dụng danh sách này để tránh ngắt dòng sai trong mã ánh xạ nguồn bên ngoài. Tên mẫu mở đầu bằng \"!\" Có thể bị loại trừ. Có thể được đặt thành một mảng trống hoặc null để tránh hạn chế.",
			"node.showAsyncStacks.description": "Hiển thị các cuộc gọi không đồng bộ gây ra ngăn xếp cuộc gọi hiện tại.",
			"node.snippet.attach.description": "Đính kèm với trình xử lý nút",
			"node.snippet.attach.label": "Node.js: Liên kết",
			"node.snippet.attachProcess.description": "Mở bộ chọn trình xử lý để chọn trình xử lý nút đích để liên kết tới",
			"node.snippet.attachProcess.label": "Node.js: Node.js: Liên kết với bộ xử lý",
			"node.snippet.electron.description": "Gỡ lỗi trình xử lý chính của Electron",
			"node.snippet.electron.label": "Node.js: Electron Main",
			"node.snippet.gulp.description": "Gỡ lỗi Gulp hoạt động (đảm bảo bạn đã cài đặt Gulp gốc trong dự án của mình)",
			"node.snippet.gulp.label": "Node.js: Làm việc với Gulp",
			"node.snippet.launch.description": "Bắt đầu chương trình nút ở chế độ gỡ lỗi",
			"node.snippet.launch.label": "Node.js: Trình khởi chạy",
			"node.snippet.mocha.description": "Gỡ lỗi thử nghiệm mocha",
			"node.snippet.mocha.label": "Node.js: Thử nghiệm Mocha",
			"node.snippet.nodemon.description": "Sử dụng gật đầu để khởi động lại các phiên gỡ lỗi khi thay đổi nguồn",
			"node.snippet.nodemon.label": "Node.js: Cài đặt Nodemon",
			"node.snippet.npm.description": "Khởi động các chương trình nút thông qua tập lệnh `debug` npm",
			"node.snippet.npm.label": "Node.js: Bắt đầu qua npm",
			"node.snippet.remoteattach.description": "Cổng gỡ lỗi được gắn vào chương trình nút từ xa",
			"node.snippet.remoteattach.label": "Node.js: đính kèm vào một chương trình từ xa",
			"node.snippet.yo.description": "Gỡ lỗi trình tạo Yeoman (cài đặt bằng cách chạy `npm link` trong thư mục dự án))",
			"node.snippet.yo.label": "Node.js: Trình tạo Yeoman",
			"node.sourceMapPathOverrides.description": "Ghi lại một tập hợp các vị trí tệp nguồn tương ứng với các vị trí trên đĩa theo hướng dẫn của bản đồ nguồn.",
			"node.sourceMaps.description": "Sử dụng bản đồ gốc JavaScript (nếu có).",
			"node.stopOnEntry.description": "Tự động dừng chương trình sau khi khởi động",
			"node.timeout.description": "Số mili giây để thử kết nối lại với Node.js. Mặc định là 10000 mili giây.",
			"node.versionHint.description": "Cho phép bạn chỉ định rõ ràng phiên bản nút đang chạy để tắt hoặc bật một số hành vi nhất định khi không thể tự động phát hiện phiên bản.",
			"node.websocket.address.description": "Địa chỉ WebSocket chính xác để đính kèm. Nếu không được chỉ định, địa chỉ và cổng sẽ được khám phá từ đó.",
			"openEdgeDevTools.label": "Mở công cụ dành cho nhà phát triển trình duyệt",
			"outFiles.description": "Nếu ánh xạ nguồn được bật, các mẫu hình cầu này sẽ chỉ định tệp JavaScript được tạo. Nếu mẫu bắt đầu bằng `!`, thì tệp bị loại trừ. Nếu không được chỉ định, mã được tạo phải nằm trong cùng thư mục với nguồn của nó.",
			"pretty.print.script": "Gỡ lỗi màn hình làm đẹp",
			"profile.start": "Sử dụng hồ sơ hiệu suất",
			"profile.stop": "Dừng hồ sơ hiệu suất",
			"remove.browser.breakpoint": "Xóa điểm dừng của trình duyệt",
			"remove.browser.breakpoint.all": "Xóa tất cả các điểm ngắt của trình duyệt",
			"requestCDPProxy.label": "Yêu cầu Proxy CDP cho phiên gỡ lỗi",
			"skipFiles.description": "Mảng các mẫu toàn cầu của tệp cần bỏ qua khi gỡ lỗi. Mẫu `<node_internals>/**` sẽ so sánh tất cả các mô-đun Node.js nội bộ.",
			"smartStep.description": "Mã được tạo bằng bước tự động (không ánh xạ trở lại nguồn ban đầu).",
			"start.with.stop.on.entry": "Bắt đầu gỡ lỗi và dừng tại điểm bắt đầu",
			"startWithStopOnEntry.label": "Bắt đầu gỡ lỗi và dừng tại điểm bắt đầu",
			"timeouts.generalDescription": "Hết thời gian chờ cho một số công việc trình gỡ lỗi.",
			"timeouts.generalDescription.markdown": "Hết thời gian chờ cho một số công việc trình gỡ lỗi.",
			"timeouts.hoverEvaluation.description": "Khoảng thời gian trước khi tạm dừng đánh giá giá trị của một ký hiệu liên tục. Nếu được đặt thành 0, đánh giá liên tục sẽ không bao giờ hết hạn.",
			"timeouts.sourceMaps.description": "Thời gian chờ liên quan đến hoạt động tương ứng với nguồn.",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Thời gian bổ sung (tính bằng mili giây) mà mỗi phiên làm việc có thể được sử dụng để chờ quá trình xử lý nguồn tương ứng sau khi hết thời gian cơ bản (sourceMapMinPause),",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Thời gian cơ bản (tính bằng mili giây) dành để chờ từng nguồn được xử lý khi định hình tập lệnh",
			"toggle.skipping.this.file": "Chuyển đổi bỏ qua tệp này",
			"trace.boolean.description": "Có thể đặt theo dõi thành 'true' để ghi nhật ký chẩn đoán vào đĩa.",
			"trace.description": "Đặt đầu ra chẩn đoán đã tạo.",
			"trace.logFile.description": "Đặt vị trí để ghi bản ghi đĩa vào",
			"trace.stdio.description": "Có trả lại dữ liệu theo dõi từ ứng dụng hoặc trình duyệt đã khởi chạy hay không.",
			"workspaceTrust.description": "Cần có sự tin cậy để gỡ lỗi mã trong không gian làm việc này."
		}
	}
}