{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"(Current Change)": "(Hiện đang thay đổi)",
			"(Incoming Change)": "(Thay đổi nguồn)",
			"Accept Both Changes": "Chấp nhận cả hai thay đổi",
			"Accept Current Change": "Chấp nhận thay đổi hiện tại",
			"Accept Incoming Change": "Chấp nhận thay đổi nguồn",
			"Compare Changes": "So sánh các thay đổi",
			"Editor cursor is not within a merge conflict": "Con trỏ trình soạn thảo không nằm trong phạm vi hợp nhất xung đột",
			"Editor cursor is within the common ancestors block, please move it to either the \"current\" or \"incoming\" block": "Con trỏ trình soạn thảo nằm trong khối thượng nguồn chung, hãy di chuyển đến khối \"current\" hoặc \"incoming\"",
			"Editor cursor is within the merge conflict splitter, please move it to either the \"current\" or \"incoming\" block": "Con trỏ của trình soạn thảo nằm trong phạm vi của công cụ hợp nhất xung đột, vui lòng chuyển sang \"current\" hoặc \"incoming \"",
			"No merge conflicts found in this file": "Không cần tìm thấy xung đột xung đột trong tệp không thể tìm thấy trong tệp",
			"No other merge conflicts within this file": "Không có sự sáp nhập xung đột nào khác trong trường hợp này",
			"{0}: Current Changes ↔ Incoming Changes": "{0}: Hiện đang thay đổi 将 Thay đổi sắp tới"
		},
		"package": {
			"command.accept.all-both": "Chấp nhận tất cả các dự án giữa hai dự án",
			"command.accept.all-current": "Chấp nhận tất cả các dự án hiện tại",
			"command.accept.all-incoming": "Chấp nhận tất cả các nguồn",
			"command.accept.both": "Chấp nhận cả hai",
			"command.accept.current": "Chấp nhận dự án hiện tại",
			"command.accept.incoming": "Chấp nhận dự án nguồn",
			"command.accept.selection": "Chấp nhận dự án lựa chọn",
			"command.category": "Xung đột",
			"command.compare": "So sánh xung đột hiện tại",
			"command.next": "Xung đột tiếp theo",
			"command.previous": "Xung đột trước đó",
			"config.autoNavigateNextConflictEnabled": "Cho dù nó được tự động hướng dẫn đến xung đột sáp nhập tiếp theo sau cuộc xung đột hợp nhất.",
			"config.codeLensEnabled": "Code Lens được thiết lập cho khối xung đột hợp nhất trong trình soạn thảo.",
			"config.decoratorsEnabled": "Thiết lập các dự án trang trí cho khối xung đột hợp nhất trong trình soạn thảo. ",
			"config.diffViewPosition": "Khi việc so sánh xung đột sáp nhập được thay đổi, nơi bắt đầu đánh giá Diff.",
			"config.diffViewPosition.below": "Bật kiểm tra diff trong nhóm biên tập viên hiện tại.",
			"config.diffViewPosition.beside": "Bật kiểm tra diff bên cạnh nhóm biên tập viên hiện tại.",
			"config.diffViewPosition.current": "Bật chế độ xem diff trong nhóm trình soạn thảo hiện tại.",
			"config.title": "Hợp nhất xung đột",
			"description": "Bắt mắt và lệnh của xung đột hợp nhất nhúng.",
			"displayName": "Xung đột"
		}
	}
}