{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"An icon requires a repository with HTTPS protocol to be specified in this package.json.": "Biểu đồ phải chỉ định thư viện lưu trữ của giao thức truyền thông HTTPS trong pack.json.",
			"Data URLs are not a valid image source.": "URL dữ liệu không phải là một nguồn hiệu quả.",
			"Embedded SVGs are not a valid image source.": "SVGs nhúng không phải là một nguồn hiệu quả.",
			"Images must use the HTTPS protocol.": "Hình ảnh phải sử dụng giao thức truyền thông HTTPS.",
			"Language specific editor settings": "Cài đặt trình soạn thảo đặc biệt ngôn ngữ",
			"Override editor settings for language": "Cài đặt cho các biên tập viên ghi đè ngôn ngữ",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Liên quan đến URL Huy hiệu phải chỉ định thư viện lưu trữ sử dụng giao thức truyền thông HTTPS trong pack.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Liên quan đến URL hình ảnh phải chỉ định thư viện lưu trữ bằng giao thức truyền thông HTTPS trong pack.json.",
			"SVGs are not a valid image source.": "SVG không phải là một nguồn hiệu quả.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Sự kiện cho phép này có thể được xóa vì mã VS sẽ tự động khai báo các sự kiện này khỏi đóng góp của bạn.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Sự kiện cho phép này có thể được gỡ bỏ để mở rộng phần mở rộng của phiên bản động cơ ^1.75, vì mã VS sẽ tự động tạo các dự án này từ đóng góp gói của bạn.",
			"This activation event cannot be explicitly listed by your extension.": "Mô -đun mở rộng của bạn không thể liệt kê rõ ràng sự kiện cho phép này.a bạn không thể liệt kê rõ ràng sự kiện cho phép này.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Dự án này không thể được sử dụng, bởi vì sản phẩm mở rộng một tập hợp các dự án API cố định cho mô-đun mở rộng này.Bạn có thể kiểm tra mô-đun mở rộng, nhưng trước khi phát hành, bạn phải liên hệ với nhóm mã VS.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Sử dụng '*' thường là một ý tưởng sai vì nó ảnh hưởng đến hiệu quả."
		},
		"package": {
			"description": "Cung cấp chức năng Lint để viết một mô -đun mở rộng.",
			"displayName": "Mở rộng văn bản mô -đun"
		}
	}
}