{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Không thể xác minh vì cài đặt PHP không được tìm thấy. 使用配置 'php.validate.executablePath' để cấu hình PHP thực thi tập.",
			"Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Không thể xác minh được vì không có tệp thực thi PHP nào được cấu hình. Bạn có thể sử dụng thiết lập php.validate.executablePath' để thiết lập các tập tin thực thi PHP.",
			"Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Không thể xác minh vì {0} không phải là tệp thực thi PHP hợp lệ. Bạn có thể sử dụng thiết lập \"php.validate.executablePath' thiết lập PHP thực thi tập tin.",
			"Failed to run php using path: {0}. Reason is unknown.": "Php không thể được thực hiện {0} bằng cách sử dụng đường dẫn. Không rõ lý do.",
			"Open Settings": "Bật cài đặt"
		},
		"package": {
			"command.untrustValidationExecutable": "Bị cấm thực hiện các tệp thực thi xác minh PHP (được định nghĩa là cài đặt khu vực làm việc)",
			"commands.categroy.php": "PHP",
			"configuration.suggest.basic": "Đặt có cho phép đề xuất ngôn ngữ PHP được xây dựng hay không.Hỗ trợ này sẽ đề xuất Php Global và các biến.",
			"configuration.title": "PHP",
			"configuration.validate.enable": "Bật/Ngừng Xây dựng -Xác minh PHP.",
			"configuration.validate.executablePath": "Pind to PHP thực thi các tệp.",
			"configuration.validate.run": "Là thực thi linter khi lưu trữ hoặc nhập.",
			"description": "Cung cấp hỗ trợ ngôn ngữ phong phú cho các tệp PHP.",
			"displayName": "Hàm ngôn ngữ PHP",
			"workspaceTrust": "Khi cài đặt 'PHP.validate.executablePath' sẽ được tải trong phiên bản PHP trong khu vực làm việc, việc mở rộng mô -đun yêu cầu sự tin tưởng của khu vực làm việc."
		}
	}
}