{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref \\'{0}\\' in \\'{1}\\' can not be resolved.": "\\'{0}\\' trong \\'{1}\\' không thể được giải quyết.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "giá trị mặc định.Khuyến khích.",
			"A descriptive title of the element.": "Mô tả phần tử.",
			"A long description of the element. Used in hover menus and suggestions.": "Mô tả chi tiết về các yếu tố.Được sử dụng cho đồng hồ phục hồi và đề xuất.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Tên thuộc tính tương ứng với mảng tên thuộc tính hoặc mô tả cấu trúc. Mảng tên thuộc tính đại diện cho các thuộc tính được chỉ định trong mã chỉ mục phụ thuộc vào các thuộc tính xuất hiện trong mảng đối tượng trước khi chúng có thể hợp lệ. Nếu giá trị là mô tả cấu trúc, mô tả cấu trúc chỉ được sử dụng vào đối tượng nếu các thuộc tính trong mã chỉ mục xuất hiện trên một đối tượng.",
			"A map of property names to schemas for each property.": "Sự tương ứng của tên thuộc tính của mỗi thuộc tính được mô tả bởi mô tả cấu trúc.",
			"A map of regular expressions on property names to schemas for matching properties.": "Sự tương ứng của các quy tắc và mô tả cấu trúc trên tên thuộc tính được sử dụng để so sánh các thuộc tính.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Giá trị của giá trị hiện tại (nghĩa là không có phần còn lại) nên được loại bỏ.",
			"A regular expression to match the string against. It is not implicitly anchored.": "Nó được sử dụng để so sánh các quy tắc của chuỗi.Không có neo.",
			"A schema which must not match.": "Mô tả cấu trúc không thỏa hiệp.",
			"A unique identifier for the schema.": "Mã nhận dạng duy nhất được mô tả bởi cấu trúc.",
			"An array instance is valid against \\\"contains\\\" if at least one of its elements is valid against the given schema.": "Nếu ít nhất một trong các yếu tố của một cá nhân thực hiện mảng có hiệu quả trong mô tả cấu trúc được chỉ định, các cá nhân thực hiện mảng có hiệu lực đối với 'contains'.",
			"An array of schemas, all of which must match.": "Các mảng được mô tả bởi cấu trúc phải nhất quán.",
			"An array of schemas, exactly one of which must match.": "Mảng mô tả cấu trúc, một trong số đó phải nhất quán.",
			"An array of schemas, where at least one must match.": "Mảng được mô tả bởi cấu trúc phải có ít nhất một nhất quán.",
			"An array of strings that lists the names of all properties required on this object.": "Mảng của chuỗi liệt kê tên của tất cả các thuộc tính cần thiết trên đối tượng này.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Nếu giá trị của cá nhân bằng giá trị của từ khóa, thì việc xác minh từ khóa của cá nhân là thành công.",
			"Array does not contain required item.": "Mảng không bao gồm các mục cần thiết.",
			"Array has duplicate items.": "Có các dự án lặp đi lặp lại.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "Có quá ít mục đáp ứng các ràng buộc có điều kiện trong mảng.Nó được dự kiến ​​là {0} trở lên.",
			"Array has too few items. Expected {0} or more.": "Có quá ít dự án.Nó phải là {0} ở trên.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Theo mô tả của cấu trúc, có quá nhiều mục trong mảng.Nó được dự kiến ​​là {0} hoặc ít hơn.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "Có quá nhiều mục đáp ứng các ràng buộc có điều kiện trong mảng.Nó được dự kiến ​​là {0} hoặc ít hơn.",
			"Array has too many items. Expected {0} or fewer.": "Có quá nhiều dự án.Nó được dự kiến ​​là {0} hoặc ít hơn.",
			"Colon expected": "Dự kiến là dấu chấm phẩy",
			"Comments are not permitted in JSON.": "Nhận xét trong JSON không được phép.",
			"Comments from schema authors to readers or maintainers of the schema.": "Cấu trúc mô tả chú thích của tác giả về mô tả cấu trúc của người đọc hoặc bảo trì.",
			"Configure": "cài đặt",
			"Configured by extension: {0}": "Đặt từ một mô -đun tiện ích mở rộng: {0}",
			"Configured in user settings": "Đặt trong cài đặt người dùng",
			"Configured in workspace settings": "Đặt trong Cài đặt khu vực làm việc",
			"Default value": "giá trị mặc định",
			"Describes the content encoding of a string property.": "Mô tả nội dung của thuộc tính chuỗi.",
			"Describes the format expected for the value.": "Giá trị mô tả là định dạng dự kiến.",
			"Describes the media type of a string property.": "Mô tả loại phương tiện của thuộc tính chuỗi.",
			"Downloading schemas is disabled through setting \\'{0}\\'": "Đặt \\'{0}}\\' Ngừng mô tả cấu trúc tải xuống",
			"Downloading schemas is disabled. Click to configure.": "Mô tả cấu trúc tải xuống đã bị ngừng.Nhấn để cài đặt.",
			"Draft-03 schemas are not supported.": "Mô tả cấu trúc Draft-03 không được hỗ trợ.",
			"Duplicate anchor declaration: \\'{0}\\'": "Thông báo điểm neo lặp đi lặp lại: \\'{0}\\'",
			"Duplicate object key": "Mã chỉ mục đối tượng lặp lại",
			"Either a schema or a boolean. If a schema, then used to validate all properties not matched by 'properties' or 'patternProperties'. If false, then any properties not matched by either will cause this schema to fail.": "Mô tả cấu trúc hoặc giá trị bollinger. Nếu đó là mô tả cấu trúc, nó được sử dụng để xác minh rằng tất cả các thuộc tính không phù hợp với 'properties' hoặc 'patternProperties'. Nếu false, bất kỳ thuộc tính không phù hợp nào có thể gây ra mô tả cấu trúc này không thành công.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Nó có thể là một trong những chuỗi mô tả cấu trúc cơ bản (số, số nguyên, Null, mảng, đối tượng, giá trị bollinger, chuỗi) hoặc một mảng chuỗi chỉ định các tập hợp con của các loại này.",
			"End of file expected.": "Phải có một kết thúc tập tin.",
			"Expected a JSON object, array or literal.": "Nó được dự kiến ​​là các đối tượng, mảng hoặc văn bản của JSON.",
			"Expected comma": "Nó được dự kiến ​​sẽ là một dấu phẩy",
			"Expected comma or closing brace": "Phải là dấu phẩy hoặc dấu ngoặc đơn bên phải",
			"Expected comma or closing bracket": "Dự kiến là dấu phẩy hoặc dấu ngoặc đơn giữa bên phải",
			"Failed to sort the JSONC document, please consider opening an issue.": "Nếu bạn không thể sắp xếp tệp JSONC, hãy xem xét bắt đầu vấn đề.",
			"For arrays, only when items is set as an array. If it is a schema, then this schema validates items after the ones specified by the items array. If it is false, then additional items will cause validation to fail.": "Đối với mảng, chỉ khi dự án được đặt thành mảng. Nếu đó là một mô tả cấu trúc, mô tả cấu trúc này xác minh các mục sau khi các mục được chỉ định trong mảng dự án. Nếu false, các mục khác sẽ gây ra xác thực không thành công.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Đối với mảng. Nó có thể là một mô tả cấu trúc, được sử dụng để xác minh một mảng của mỗi phần tử hoặc mô tả cấu trúc, được sử dụng để xác minh từng mục theo thứ tự (mô tả cấu trúc đầu tiên sẽ xác minh yếu tố đầu tiên và mô tả cấu trúc thứ hai sẽ xác minh yếu tố thứ hai, v.v.).",
			"If all of the items in the array must be unique. Defaults to false.": "Nếu tất cả các mục trong mảng phải là duy nhất. Mặc định là false.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Nếu cá nhân thực hiện là một đối tượng, từ khóa này xác minh rằng mỗi tên thuộc tính trong cá nhân thực hiện có thể được xác minh cho mô tả cấu trúc được cung cấp.",
			"Incorrect type. Expected \"{0}\".": "Loại không chính xác.Phải là \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Loại không chính xác. Phải là một trong những {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Giá trị của việc thực hiện cá nhân sẽ được quản lý bởi đơn vị được ủy quyền.",
			"Invalid characters in string. Control characters must be escaped.": "Ký tự trong chuỗi không hợp lệ.Từ kiểm soát phải được phản ánh.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Định dạng màu không hợp lệ.Vui lòng sử dụng #RGB, #RGBA, #RRGGBB hoặc #RRGGBBAA.",
			"Invalid escape character in string.": "Các ký tự thoát ra trong chuỗi không hợp lệ.",
			"Invalid number format.": "Định dạng số không hợp lệ.",
			"Invalid unicode sequence in string.": "Trình tự Unicode trong chuỗi không hợp lệ.",
			"Item does not match any validation rule from the array.": "Dự án không đáp ứng bất kỳ quy tắc xác minh nào từ mảng.",
			"JSON Language Server": "Máy chủ ngôn ngữ JSON",
			"JSON Outline Status": "Trạng thái phác thảo JSON",
			"JSON Validation Status": "Trạng thái xác minh JSON",
			"JSON schema cache cleared.": "Mô tả cấu trúc JSON được xóa.",
			"JSON schema configured": "Mô tả cấu trúc JSON đã được đặt",
			"JSON: Schema Resolution Error": "JSON: Lỗi phân tích mô tả cấu trúc",
			"Learn more about JSON schema configuration...": "Trong sự hiểu biết về cài đặt mô tả cấu trúc JSON...",
			"Loading JSON info": "Tải thông tin JSON",
			"Makes the maximum property exclusive.": "Loại trừ thuộc tính tối đa.",
			"Makes the minimum property exclusive.": "Loại trừ các thuộc tính tối thiểu.",
			"Matches a schema that is not allowed.": "So sánh các mô tả cấu trúc không được phép.",
			"Matches multiple schemas when only one must validate.": "Khi chỉ có một phải được xác minh, so sánh nhiều mô tả cấu trúc.",
			"Missing property \"{0}\".": "Mất các thuộc tính \"{0}\".",
			"New array": "Mảng mới",
			"New object": "Đối tượng mới",
			"No Schema Validation": "Không xác minh mô tả cấu trúc",
			"No schema configured for this file": "Không có mô tả cấu trúc của tệp này",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Không được sử dụng để xác minh. Đặt mô tả cấu trúc con mà bạn muốn sử dụng tham chiếu nhúng $ref ở đây.",
			"Object has fewer properties than the required number of {0}": "Các thuộc tính của các đối tượng nhỏ hơn số lượng đối tượng cần {0}",
			"Object has more properties than limit of {0}.": "Các thuộc tính của các đối tượng vượt quá giới hạn của {0}.",
			"Object is missing property {0} required by property {1}.": "Đối tượng bị thiếu thuộc tính {0} yêu cầu của tài sản {1}.",
			"Open Extension": "Mở một phần mở rộng",
			"Open Settings": "Bật cài đặt",
			"Outline": "Phác thảo",
			"Problem reading content from \\'{0}\\': UTF-8 with BOM detected, only UTF 8 is allowed.": "Sự cố xảy ra khi đọc nội dung từ \\'{0}\\': UTF-8 với BOM được phát hiện nhưng chỉ cho phép UTF-8.",
			"Problems loading reference \\'{0}\\': {1}": "Vấn đề xảy ra khi tải tham chiếu \\'{0}\\': {1}",
			"Property expected": "Dự kiến là thuộc tính",
			"Property keys must be doublequoted": "Các phím chỉ mục thuộc tính phải được bao quanh bằng dấu ngoặc kép",
			"Property {0} is not allowed.": "Không cho phép thuộc tính {0}." ,
			"Reference a definition hosted on any location.": "tham khảo định nghĩa được lưu trữ ở bất kỳ vị trí nào." ,
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Để minh cách sử dụng, mô tả cấu trúc giá trị cụ thể liên quan đến mẫu JSON ." ,
			"Schema Validated": "Mô tả cấu trúc đã được xác minh",
			"Select the schema to use for {0}": "Chọn mô tả cấu trúc để sử dụng cho {0}",
			"Show Schemas": "Mô tả cấu trúc hiển thị",
			"String does not match the pattern of \"{0}\".": "Chuỗi không khớp với chế độ của \"{0}\".",
			"String is longer than the maximum length of {0}.": "Chuỗi vượt quá giới hạn trên của độ dài {0}.",
			"String is not a RFC3339 date-time.": "Chuỗi không phải là thời gian ngày RFC3339.",
			"String is not a RFC3339 date.": "Chuỗi không phải là ngày RFC3339.",
			"String is not a RFC3339 time.": "Chuỗi không phải là thời gian RFC3339.",
			"String is not a URI: {0}": "Chuỗi không phải là URI: {0}",
			"String is not a hostname.": "Chuỗi không phải là tên máy chủ.",
			"String is not an IPv4 address.": "Chuỗi không phải là địa chỉ IPv4.",
			"String is not an IPv6 address.": "Chuỗi không phải là địa chỉ IPv6.",
			"String is not an e-mail address.": "Chuỗi không phải là một địa chỉ email.",
			"String is shorter than the minimum length of {0}.": "Chuỗi ngắn hơn độ dài tối thiểu {0}.",
			"The \\\"else\\\" subschema is used for validation when the \\\"if\\\" subschema fails.": "\\\"if\\\" mô tả cấu trúc con không thành công, mô tả cấu trúc con \\\"else\\\" được xác minh.",
			"The \\\"if\\\" subschema is used for validation when the \\\"if\\\" subschema succeeds.": "\\\"if\\\" mô tả cấu trúc con thành công, mô tả cấu trúc con \\\"if\\\" được xác minh.",
			"The maximum length of a string.": "Độ dài của chuỗi.",
			"The maximum number of items that can be inside an array. Inclusive.": "Giới hạn trên của số lượng các mục trong mảng bao gồm.",
			"The maximum number of properties an object can have. Inclusive.": "Số lượng thuộc tính có thể được sở hữu bởi các đối tượng có thể bị giới hạn bao gồm.",
			"The maximum numerical value, inclusive by default.": "Giới hạn trên của giá trị, mặc định được bao gồm.",
			"The minimum length of a string.": "Độ dài tối thiểu của chuỗi.",
			"The minimum number of items that can be inside an array. Inclusive.": "Giới hạn dưới của các mục trong mảng có thể bao gồm.",
			"The minimum number of properties an object can have. Inclusive.": "Giới hạn thấp hơn của số lượng thuộc tính có thể được sở hữu.Bao gồm.",
			"The minimum numerical value, inclusive by default.": "Giới hạn thấp hơn được chứa trong cài đặt trước.",
			"The schema to verify this document against.": "Nó được sử dụng để xác minh mô tả cấu trúc của tệp này.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Lược đồ sử dụng các tính năng meta-schema ({0}) chưa được trình xác thực hỗ trợ",
			"The set of literal values that are valid.": "Một tập hợp các giá trị văn bản hiệu quả.",
			"The validation outcome of the \\\"if\\\" subschema controls which of the \\\"then\\\" or \\\"else\\\" keywords are evaluated.": "\\\"if\\\"Kết quả xác minh được mô tả bởi cấu trúc con sẽ kiểm soát từ khóa \\\"then\\\" hoặc \\\"else\\\".",
			"Trailing comma": "Dấu phẩy phía sau",
			"URI expected.": "Phải có uri.",
			"URI is expected.": "Nó phải là Uri.",
			"URI with a scheme is expected.": "Nó phải được cấu hình URI.",
			"Unable to compute used schemas: No document": "Không thể tính toán mô tả cấu trúc: Không có tệp",
			"Unable to compute used schemas: {0}": "Không thể tính toán mô tả cấu trúc của việc sử dụng: {0}",
			"Unable to load schema from \\'{0}\\'. No schema request service available": "Mô tả cấu trúc không thể được tải từ \\'{0}\\'. Không có mô tả cấu trúc có sẵn yêu cầu dịch vụ",
			"Unable to load schema from \\'{0}\\': No content.": "Không thể tải mô tả cấu trúc từ \\'{0}\\': Không có nội dung.",
			"Unable to load schema from \\'{0}\\': {1}.": "Mô tả cấu trúc không thể tải từ '{0}': {1}.",
			"Unable to load {0}": "Không thể tải {0}",
			"Unable to parse content from \\'{0}\\': Parse error at offset {1}.": "Không thể phân tích nội dung từ \\'{0}\\': Phát hiện lỗi phân tích {1}.",
			"Unable to resolve schema. Click to retry.": "Không thể giải quyết mô tả cấu trúc.Bấm để thử lại.",
			"Unexpected end of comment.": "Chú thích bất ngờ kết thúc.",
			"Unexpected end of number.": "Số không thể đoán trước kết thúc.",
			"Unexpected end of string.": "Kết thúc bất ngờ của chuỗi.",
			"Value expected": "Hy vọng",
			"Value is above the exclusive maximum of {0}.": "Giá trị tối đa của giá trị của giá trị cao hơn {0}.",
			"Value is above the maximum of {0}.": "Giá trị tối đa cao hơn {0}.",
			"Value is below the exclusive minimum of {0}.": "Giá trị tối thiểu của giá trị của giá trị thấp hơn {0}.",
			"Value is below the minimum of {0}.": "Giá trị tối thiểu thấp hơn {0}.",
			"Value is deprecated": "Giá trị đã được thay thế",
			"Value is not accepted. Valid values: {0}.": "Giá trị không được chấp nhận. Giá trị hợp lệ: : {0}。",
			"Value is not divisible by {0}.": "Giá trị không thể được loại bỏ bởi {0}.",
			"Value must be {0}.": "Giá trị phải là {0}。",
			"multiple JSON schemas configured": "Nhiều mô tả cấu trúc JSON đã được đặt",
			"no JSON schema configured": "Mô tả cấu trúc JSON không được thiết lập",
			"only {0} document symbols shown for performance reasons": "Chỉ hiển thị {0} biểu tượng tài liệu (lý do hiệu suất)"
		},
		"package": {
			"description": "Cung cấp hỗ trợ ngôn ngữ phong phú cho các tệp JSON",
			"displayName": "Chức năng ngôn ngữ JSON",
			"json.clickToRetry": "Bấm để thử lại.",
			"json.colorDecorators.enable.deprecationMessage": "đặt 'json.colorDecorators.enable' đã loại, sẽ thay đổi thành 'editor.colorDecorators'.",
			"json.colorDecorators.enable.desc": "Bật hoặc tắt các mục trang trí màu",
			"json.command.clearCache": "Xóa cấu trúc mô tả nhanh",
			"json.command.sort": "Sắp xếp tệp",
			"json.enableSchemaDownload.desc": "Nếu nó được bật, mô tả cấu trúc JSON có thể được ghi lại từ các vị trí HTTP và HTTPS.",
			"json.format.enable.desc": "Bật/Dừng định dạng JSON đặt trước",
			"json.format.keepLines.desc": "Tất cả các dòng mới hiện có được giữ lại trong quá trình định dạng.",
			"json.maxItemsComputed.desc": "Số lượng ký hiệu phác thảo và tính toán số lượng khu vực gấp (giới hạn do hiệu quả).",
			"json.maxItemsExceededInformation.desc": "Thông báo được hiển thị trên giới hạn trên của số lượng ký hiệu phác thảo và số lượng khu vực gấp.",
			"json.schemaResolutionErrorMessage": "Không thể giải quyết mô tả cấu trúc.",
			"json.schemas.desc": "Mô tả cấu trúc được thiết lập với tệp JSON dự án hiện tại.",
			"json.schemas.fileMatch.desc": "Các kiểu tệp khác nhau được sử dụng để so sánh khi tệp JSON được mô tả như một mô tả cấu trúc.Bạn có thể sử dụng '*' như một ký tự phổ quát hoặc bạn có thể sử dụng '!' Để xác định kiểu loại trừ.Miễn là có một kiểu so sánh, tệp sẽ được so sánh và kiểu so sánh cuối cùng không được loại bỏ.",
			"json.schemas.fileMatch.item.desc": "Nó có thể chứa chế độ lưu trữ '*', đây là một đối tượng so sánh khi phân tích tệp JSON vào một mô tả cấu trúc.",
			"json.schemas.schema.desc": "Chỉ định mô tả cấu trúc của URL.Chỉ cần cung cấp các mô tả cấu trúc để tránh URL mô tả cấu trúc truy cập.",
			"json.schemas.url.desc": "Mô tả cấu trúc của URL thư mục hiện tại hoặc mô tả cấu trúc đường dẫn tương đối",
			"json.tracing.desc": "Theo dõi giao tiếp giữa mã vs và máy chủ ngôn ngữ JSON.",
			"json.validate.enable.desc": "Bật/dừng xác minh JSON."
		}
	}
}