{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Could not find a valid npm script at the selection.": "Không tìm thấy mã hướng dẫn NPM hiệu quả trong phạm vi lựa chọn.",
			"Debug": "Phát hiện",
			"Debug Script": "Thể hiện mã lệnh",
			"Default bower.json": "Đặt trước Bower.json",
			"Default package.json": "Gói đặt trước Gói.json",
			"Do not show again": "Không hiển thị nó một lần nữa",
			"Latest version: {0}": "Phiên bản mới nhất: {0}",
			"Learn more": "Hiểu sâu hơn",
			"Matches the most recent major version (1.x.x)": "Theo dõi phiên bản chính mới nhất (1.x.x)",
			"Matches the most recent minor version (1.2.x)": "Theo dõi phiên bản thứ cấp mới nhất (1.2.x)",
			"No scripts found.": "Không thể tìm thấy bất kỳ mã lệnh nào.",
			"Npm task detection: failed to parse the file {0}": "Npm Phát hiện công việc: Không thể phân tích các tệp {0}",
			"Request to the NPM repository failed: {0}": "Các yêu cầu đối với cơ chế lưu trữ NPM không thành công: {0}",
			"Request to the bower repository failed: {0}": "Các yêu cầu đối với cơ chế lưu trữ Bower không thành công: {0}",
			"Run Script": "Thực hiện mã lệnh",
			"Run the script as a task": "Thực hiện mã chỉ thị dưới dạng công việc",
			"Runs the script under the debugger": "Thực hiện mã lệnh trong công cụ phát hiện",
			"The currently latest version of the package": "Phiên bản mới nhất của gói",
			"The setting \"npm.autoDetect\" is \"off\".": "đặt \"npm.autoDetect\" cho \"off\".",
			"Using {0} as the preferred package manager. Found multiple lockfiles for {1}.  To resolve this issue, delete the lockfiles that don\\'t match your preferred package manager or change the setting \"npm.packageManager\" to a value other than \"auto\".": "Sử dụng {0} làm quản trị viên bộ quen thuộc. Tìm hồ sơ bị khóa cho nhiều {1}. Để giải quyết vấn đề này, xóa các tập tin bị khóa không phù hợp với quản trị viên bộ quen thuộc của bạn hoặc thay đổi cài đặt \"npm.packageManager\" thành một giá trị khác ngoài [tự động].",
			"latest": "cập nhật"
		},
		"package": {
			"command.debug": "Phát hiện",
			"command.openScript": "Mở",
			"command.packageManager": "Nhận tập hợp các bộ bộ",
			"command.refresh": "tái tổ chức",
			"command.run": "thực hiện",
			"command.runInstall": "Thực hiện cài đặt",
			"command.runScriptFromFolder": "Thực hiện mã lệnh npm trong thư mục...",
			"command.runSelectedScript": "Thực hiện mã lệnh",
			"config.npm.autoDetect": "Kiểm soát xem có tự động phát hiện mã lệnh NPM hay không.",
			"config.npm.enableRunFromFolder": "Mã lệnh NPM chứa thực thi có trong thư mục được bật từ đồng hồ đo hoạt động Explorer.",
			"config.npm.enableScriptExplorer": "Khi không có tệp 'Gói.json' của lớp trên, việc quản lý đầu của mã lệnh NPM được bật.",
			"config.npm.exclude": "Thiết lập chế độ Glob cho các thư mục bị loại trừ khỏi phát hiện mã hướng dẫn tự động.",
			"config.npm.fetchOnlinePackageInfo": "Trích xuất dữ liệu từ https://registry.npmjs.org và https://registry.bower.io để cung cấp khả năng tự động hoàn thành và hiển thị thông tin động gắn liền với npm.",
			"config.npm.packageManager": "Đặt quản trị viên được sử dụng để thực thi mã lệnh.",
			"config.npm.packageManager.auto": "Theo tệp khóa và quản trị viên bộ đã cài đặt, quản trị viên bộ dụng cụ được sử dụng để thực thi mã lệnh được tự động phát hiện.",
			"config.npm.packageManager.npm": "Sử dụng NPM làm quản trị viên bộ dụng cụ thực thi mã lệnh.",
			"config.npm.packageManager.pnpm": "Sử dụng PNPM làm quản trị viên bộ dụng cụ thực thi mã lệnh.",
			"config.npm.packageManager.yarn": "Sử dụng sợi làm quản trị viên bộ dụng cụ thực thi mã hướng dẫn.",
			"config.npm.runSilent": "Thực hiện lệnh npm với tùy chọn '--silent'. ",
			"config.npm.scriptExplorerAction": "Hành động phím mặc định được sử dụng trong quản lý mã hướng dẫn npm: Bật hoặc thực hiện, mặc định là bật.",
			"config.npm.scriptExplorerExclude": "Mảng biểu thức quy tắc chỉ ra mã hướng dẫn nên được loại trừ khỏi kiểm tra mã hướng dẫn NPM.",
			"config.npm.scriptHover": "Sử dụng các lệnh 'Run' và 'Debug' của mã lệnh để hiển thị tạm dừng.",
			"description": "Thêm mô-đun mở rộng hỗ trợ công việc cho mã hướng dẫn npm.",
			"displayName": "Hỗ trợ npm của mã vs",
			"npm.parseError": "Phát hiện công việc NPM: Không thể phân tích các tệp {0}",
			"taskdef.path": "Cung cấp đường dẫn thư mục của tệp mã hướng dẫn.json.Nó có thể được bỏ qua.",
			"taskdef.script": "Để tùy chỉnh mã lệnh NPM.",
			"view.name": "Mã hướng dẫn NPM",
			"virtualWorkspaces": "Không gian làm việc ảo không thể sử dụng các tính năng cần thực hiện lệnh 'npm'.",
			"workspaceTrust": "Mô-đun mở rộng này thực hiện công việc đòi hỏi phải thực hiện đáng tin cậy."
		}
	}
}