{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"store\" một bài kiểm tra giá trị bollinger để đánh giá sau này trong guard hoặc if().",
			"'from' expected": "phải có 'from'.",
			"'in' expected": "phải có 'in'",
			"'through' or 'to' expected": "cần phải 'through' hoặc 'to'",
			"'{0}'": "'{0}'",
			"( expected": "phải có (",
			") expected": "phải có )",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "Quy tắc @font-face phải xác định các thuộc tính 'src' và 'font-family'",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Không có danh sách các thuộc tính được xác minh bằng cách xác minh quy tắc của `UnknownProperies`.",
			"Adds quotes to a string.": "Đã thêm dấu ngoặc kép vào chuỗi.",
			"Also define the standard property '{0}' for compatibility": "Nó cũng xác định các thuộc tính tiêu chuẩn '{0}' để có được khả năng tương thích",
			"Always define standard rule '@keyframes' when defining keyframes.": "Khi xác định lưới ảnh chính, các quy tắc tiêu chuẩn sẽ được xác định '@KeyFrames'.",
			"Always include all vendor specific properties: Missing: {0}": "Tất cả bao gồm tất cả các thuộc tính cụ thể của nhà sản xuất: bị mất: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Tất cả đều chứa tất cả các quy tắc cụ thể của nhà cung cấp: bị mất: {0}",
			"Appends a single value onto the end of a list.": "Đính kèm một giá trị duy nhất vào cuối danh sách.",
			"Appends selectors to one another without spaces in between.": "Gắn thiết bị đã chọn với nhau, nhưng không có khoảng trống giữa hai.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Tránh sử dụng !important。 Điều này có nghĩa là sự rõ ràng của toàn bộ CSS là ngoài tầm kiểm soát và cần phải được tái cấu trúc.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Tránh sử dụng 'float'. Nổi có thể làm cho CSS dễ bị tổn thương và dễ bị gián đoạn khi thay đổi ở bất kỳ cấp độ nào của cấu hình bố cục.",
			"Causes one or more rules to be emitted at the root of the document.": "Do đó, một hoặc nhiều quy tắc được ban hành trong thư mục gốc tệp.",
			"Changes one or more properties of a color.": "Một hoặc nhiều thuộc tính để thay đổi màu sắc.",
			"Changes the alpha component for a color.": "Thay đổi thành phần màu alpha.",
			"Changes the hue of a color.": "Thay đổi màu màu.",
			"Character entity representing \\'{0}\\'": "Thực thể ký tự của \\'{0}\\' ",
			"Character entity representing \\'{0}\\', unicode equivalent \\'{1}\\'": "Unicode đại diện cho'{0}' (tương đương '{1}' của Unicode)",
			"Closing bracket expected.": "Phải là dấu ngoặc đơn giữa bên phải.",
			"Closing bracket missing.": "Bỏ lỡ dấu ngoặc đơn bên phải.",
			"Combines several lists into a single multidimensional list.": "Kết hợp một số danh sách kiểm tra thành một danh sách đa chiều duy nhất.",
			"Configure": "cài đặt",
			"Converts a color into the format understood by IE filters.": "Chuyển đổi màu sang định dạng có thể được hiểu bằng cách sàng lọc IE.",
			"Converts a color to grayscale.": "Chuyển đổi màu sang màu xám.",
			"Converts a string to lower case.": "Chuyển đổi chuỗi thành chữ thường.",
			"Converts a string to upper case.": "Chuyển đổi chuỗi thành chữ hoa.",
			"Converts a unitless number to a percentage.": "Chuyển đổi số mà không có đơn vị thành tỷ lệ phần trăm.",
			"Creates a Color from hue, saturation, and lightness values.": "Tạo màu từ tông màu, độ bão hòa và độ sáng.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Thiết lập màu sắc từ tông màu, độ bão hòa, độ sáng và giá trị alpha.",
			"Creates a Color from hue, white and black.": "Tạo màu từ màu sắc, trắng và đen.",
			"Creates a Color from red, green, and blue values.": "Tạo màu từ màu đỏ, xanh lá cây và xanh dương.",
			"Creates a Color from red, green, blue, and alpha values.": "Thiết lập màu sắc từ các giá trị màu đỏ, xanh lá cây, xanh dương và alpha.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Xác định các công việc phức tạp có thể được tái sử dụng trong biểu định kiểu.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Xác định kiểu có thể được sử dụng lại trong toàn bộ bảng kiểu với '@include'.",
			"Do not use duplicate style definitions": "Không sử dụng các định nghĩa kiểu lặp đi lặp lại",
			"Do not use empty rulesets": "Không sử dụng bộ quy tắc trống",
			"Do not use width or height when using padding or border": "Không sử dụng width 或 height khi sử dụng padding hoặc border.",
			"Dynamically calls a Sass function.": "Tự động gọi hàm Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Đặt \"$var\" thành danh sách hoặc mỗi mục trong tương ứng, sau đó xuất ra kiểu có trong giá trị \"$var\".",
			"End tag name expected.": "Phải có một tên đánh dấu kết thúc.",
			"Exposes the details of Sass’s inner workings.": "Thông tin chi tiết về công việc nội bộ của SASS.",
			"Extends $extendee with $extender within $selector.": "Sử dụng $selector trong $extender mở $extendee.",
			"Extracts a substring from $string.": "Trích xuất một $substring từ $String",
			"Finds the maximum of several numbers.": "Tìm giá trị tối đa của một số.",
			"Finds the minimum of several numbers.": "Tìm giá trị tối thiểu cho một số.",
			"Fluidly scales one or more properties of a color.": "Thu phóng một hoặc nhiều thuộc tính của màu sắc một cách trơn tru.",
			"Folding Region End": "Kết thúc khu vực gấp",
			"Folding Region Start": "Khu vực gấp bắt đầu",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Thích hợp cho một tập hợp các phong cách trong một trong các mệnh đề '$var' 'from/through' hoặc 'from/to' trong đầu ra lặp đi lặp lại.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Theo các màu hiện có, chủ đề màu sắc dễ dàng được xây dựng.",
			"Gets the blue component of a color.": "Các thành phần màu xanh để có được màu sắc.",
			"Gets the green component of a color.": "Các thành phần màu xanh lá cây để có được màu sắc.",
			"Gets the hue component of a color.": "Nhận các thành phần màu màu.",
			"Gets the lightness component of a color.": "Nhận phần tử độ sáng màu.",
			"Gets the opacity component of a color.": "Nhận phần tử mờ màu.",
			"Gets the red component of a color.": "Nhận các thành phần màu đỏ đầy màu sắc.",
			"Gets the saturation component of a color.": "Nhận các thành phần đầy màu sắc.",
			"HTML Language Server": "Máy chủ ngôn ngữ HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "Mười sáu màu sắc phải bao gồm ba, bốn, sáu hoặc tám số thập lục phân",
			"IE hacks are only necessary when supporting IE7 and older": "IE hack chỉ được yêu cầu khi hỗ trợ các phiên bản IE7 trở lên",
			"Import statements do not load in parallel": "Câu lệnh tuyên bố sẽ không được tải song song",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Nếu kết quả tính toán không phải là 'false' hoặc 'null', nó chứa một hiệu trưởng.",
			"Includes the styles defined by another mixin into the current rule.": "Chứa một định nghĩa mixen khác cho các quy tắc hiện tại.",
			"Increases or decreases one or more components of a color.": "Tăng hoặc giảm một hoặc nhiều thành phần màu sắc.",
			"Inherits the styles of another selector.": "Kế thừa phong cách của một bộ chọn khác.",
			"Inserts $insert into $string at $index.": "Chèn $insert vào $string tại $index.",
			"Invalid number of parameters": "Số tham số không hợp lệ",
			"Joins together two lists into one.": "Kết hợp hai danh sách vào một danh sách.",
			"Lets you access and modify values in lists.": "Cho phép bạn truy cập và sửa đổi giá trị trong danh sách.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "載入 Sass 樣式表，當此樣式表載入 @use 規則時，使用其 mixin、函數和變數。",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Tải Mixin, chức năng và biến từ các biểu định kiểu Sass khác thành \"mô-đun\" và kết hợp CSS từ nhiều biểu định kiểu.",
			"Makes a color darker.": "Làm cho màu sắc sâu hơn.",
			"Makes a color less saturated.": "Làm cho màu ít bão hòa.",
			"Makes a color lighter.": "Làm cho màu sáng hơn.",
			"Makes a color more opaque.": "Làm cho màu trong suốt hơn.",
			"Makes a color more saturated.": "Làm cho màu sắc bão hòa hơn.",
			"Makes a color more transparent.": "Làm cho màu trong suốt hơn.",
			"Makes it easy to combine, search, or split apart strings.": "Dễ dàng hợp nhất, tìm kiếm hoặc chia chuỗi.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Có nhiều chức năng cho phép bạn truy vấn giá trị được liên kết với mã tuyến tính trung bình tương ứng.",
			"Merges two maps together into a new map.": "Hợp nhất hai bản đồ vào một bản đồ mới.",
			"Mixes two colors together.": "Trộn hai màu với nhau.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Chọn tổ giống như nhau, giống như xây dựng một tổ trong bảng kiểu.",
			"No unit for zero needed": "Không cần không",
			"Parses a selector into the format returned by &.": "Phân tích thiết bị đã chọn theo định dạng của Return được truyền bởi &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "In giá trị điện toán vào luồng dữ liệu đầu ra lỗi tiêu chuẩn.Thích hợp cho các tập tin SASS phức tạp.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Xuất giá trị tính toán vào luồng dữ liệu đầu ra lỗi tiêu chuẩn. Áp dụng cho các thư viện yêu cầu cảnh báo người dùng để loại bỏ hoặc khôi phục lỗi từ mixin thứ cấp. Bạn có thể tắt cảnh báo bằng cách sử dụng tùy chọn dòng lệnh '--quiet' hoặc tùy chọn ':quiet' Sass.",
			"Property is ignored due to the display.": "Thuộc tính đã được bỏ qua vì lý do được hiển thị.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Bởi vì hiển thị, thuộc tính đã được bỏ qua. Đối với 'display: block', căn chỉnh dọc không nên được sử dụng.",
			"Provides access to Sass’s powerful selector engine.": "Cung cấp quyền truy cập vào công cụ bộ chọn mạnh mẽ của Sass.",
			"Provides functions that operate on numbers.": "Cung cấp các chức năng làm việc trên các số.",
			"Removes quotes from a string.": "Hủy bỏ các trích dẫn trong chuỗi.",
			"Rename to '{0}'": "Đổi tên '{0}'",
			"Replaces $original with $replacement within $selector.": "Thay thế $original bằng $replacement trong $selector.",
			"Replaces the nth item in a list.": "Thay thế dự án n trong danh sách.",
			"Returns a list of all keys in a map.": "Quay trở lại danh sách tất cả các mã chỉ mục trong tương ứng.",
			"Returns a list of all values in a map.": "Quay trở lại danh sách tất cả các giá trị trong tương ứng.",
			"Returns a new map with keys removed.": "Gửi lại bản đồ mới đã xóa khóa.",
			"Returns a random number.": "Trả về một số ngẫu nhiên",
			"Returns a specific item in a list.": "Quay trở lại một mục cụ thể trong danh sách.",
			"Returns the absolute value of a number.": "Giá trị tuyệt đối của số số.",
			"Returns the complement of a color.": "Thuốc bổ cho màu.",
			"Returns the index of the first occurance of $substring in $string.": "Quay trở lại chỉ mục của $substring xảy ra lần đầu tiên trong $string.",
			"Returns the inverse of a color.": "Chức năng ngược của màu sắc được truyền trở lại.",
			"Returns the keywords passed to a function that takes variable arguments.": "Trả về từ khóa được truyền đến một hàm sử dụng tham số biến.",
			"Returns the length of a list.": "Độ dài của danh sách được gửi trở lại.",
			"Returns the number of characters in a string.": "Số lượng ký tự trong chuỗi từ",
			"Returns the position of a value within a list.": "Giá trị trả về nằm trong danh sách.",
			"Returns the separator of a list.": "Dòng phân tách của danh sách.",
			"Returns the simple selectors that comprise a compound selector.": "Bộ chọn đơn giản của thiết bị lựa chọn tổng hợp được trả về.",
			"Returns the string representation of a value as it would be represented in Sass.": "Chuỗi giá trị trở lại được biểu thị trong SASS.",
			"Returns the type of a value.": "Loại giá trị trả lại.",
			"Returns the unit(s) associated with a number.": "Quay lại các đơn vị liên quan đến số.",
			"Returns the value in a map associated with a given key.": "Giá trị tương ứng với mã biểu tượng được chỉ định được truyền lại.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Cho dù $super trở lại phù hợp với tất cả các yếu tố mà $sub phù hợp và liệu nó có phù hợp với dự án nhiều hơn hay không.",
			"Returns whether a feature exists in the current Sass runtime.": "Liệu chức năng sao lưu tồn tại trong giai đoạn thực hiện SASS hiện tại.",
			"Returns whether a function with the given name exists.": "Đưa trở lại các hàm có tên được chỉ định tồn tại." ,
			"Returns whether a map has a value associated with a given key.": "Trả về tương ứng với các giá trị liên quan đến mã chỉ mục được chỉ định." ,
			"Returns whether a mixin with the given name exists.": "Cho dù mixin với một tên cụ thể tồn tại.",
			"Returns whether a number has units.": "Gửi lại số có đơn vị." ,
			"Returns whether a variable with the given name exists in the current scope.": "Truyền trở lại biến có tên được chỉ định tồn tại trong phạm vi hiện tại." ,
			"Returns whether a variable with the given name exists in the global scope.": "Truyền trở lại biến có tên được chỉ định tồn tại trong phạm vi toàn cầu." ,
			"Returns whether two numbers can be added, subtracted, or compared.": "Cho dù hai số trở lại có thể được thêm vào, trừ hoặc so sánh." ,
			"Rounds a number down to the previous whole number.": "Bỏ số vô điều kiện đến số nguyên trước đó." ,
			"Rounds a number to the nearest whole number.": "Bỏ số đến số nguyên gần nhất." ,
			"Rounds a number up to the next whole number.": "Chuyển số vô điều kiện đến số nguyên tiếp theo." ,
			"Sass documentation": "Tài liệu sass",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Bộ chọn không nên chứa ID vì các quy tắc này kết hợp quá chặt chẽ với HTML." ,
			"Simple HTML5 starting point": "HTML5 điểm khởi đầu đơn giản",
			"Start tag name expected.": "Phải có tên bắt đầu đánh dấu." ,
			"Tag name must directly follow the open bracket.": "Tên thẻ phải theo dõi trực tiếp sau dấu ngoặc đơn bên trái." ,
			"The universal selector (*) is known to be slow": "Bộ chọn chung được biết đến (*) chậm",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Ném ra các giá trị tính toán như một lỗi nghiêm trọng trong việc theo dõi xếp chồng lên nhau. Thích hợp cho các tham số để xác minh Mixin và chức năng. ",
			"URI expected": "Phải có URI",
			"URL encodes a string": "URL mã hóa từ chuỗi",
			"Unexpected character in tag.": "Có các ký tự không mong đợi trong tab." ,
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Hợp nhất hai bộ chọn để tạo ra bộ chọn phù hợp với các yếu tố phù hợp với cả hai.",
			"Unknown at-rule.": "không xác định at-rule." ,
			"Unknown property.": "Thuộc tính không xác định." ,
			"Unknown property: '{0}'": "Thuộc tính không xác định: '{0}'",
			"Unknown vendor specific property.": "Thuộc tính cụ thể của nhà sản xuất không xác định." ,
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "VS Code bây giờ có hỗ trợ nhãn đổi tên tự động tích hợp. Bạn có muốn kích hoạt không?",
			"When using a vendor-specific prefix also include the standard property": "cũng bao gồm các thuộc tính tiêu chuẩn khi sử dụng các từ trước dành riêng cho nhà sản xuất",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Khi sử dụng các từ trước dành riêng cho nhà cung cấp, hãy chắc chắn rằng cũng bao gồm tất cả các thuộc tính độc quyền của nhà cung cấp khác",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to 'false'.": "While vòng lặp sẽ có biểu thức và lặp lại kiểu tổ đầu ra cho đến khi tuyên bố được đánh giá là 'false'." ,
			"[ expected": "Phải có [",
			"[Selector Specificity](https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity): ({0}, {1}, {2})": "[Bộ chọn rõ ràng]( https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity): ({0}、{1}、{2})",
			"] expected": "phải là ]",
			"absolute value of a number": "giá trị tuyệt đối của các con số",
			"arccosine - inverse of cosine function": "chống dư âm - đảo ngược của dư âm",
			"arcsine - inverse of sine function": "Dù sao dây - đảo ngược của chức năng sin",
			"arctangent - inverse of tangent function": "Dù sao cắt - đảo ngược chức năng cắt",
			"argument from '{0}'": "Từ '{0}''",
			"at-rule or selector expected": "phải có at-rule hoặc bộ chọn",
			"at-rule unknown": "không biết的 at-rule",
			"bind the evaluation of a ruleset to each member of a list.": "Liên kết đánh giá của quy tắc với mọi thành viên của danh sách." ,
			"calculates square root of a number": "tính toán căn bậc hai của số",
			"colon expected": "Phải có dấu hai chấm",
			"comma expected": "Phải có dấu phẩy",
			"condition expected": "Phải có điều kiện",
			"converts numbers from one type into another": "Chuyển đổi số từ loại này sang loại khác",
			"converts to a %, e.g. 0,5 > 50%": "chuyển đổi thành %, ví dụ: 0,5 > 50%",
			"cosine function": "hàm dư âm",
			"creates a #AARRGGBB": "Xây dựng #AARRGGBB",
			"creates a color": "tạo ra một màu",
			"dot expected": "Phải là điểm",
			"escape string content": "Thoát khỏi nội dung chuỗi",
			"expression expected": "Phải là biểu thức",
			"first argument modulus second argument": "hướng dẫn đầu tiên so với hướng dẫn thứ hai để lấy mô-đun",
			"first argument raised to the power of the second argument": "đầu tiên dẫn đầu thứ hai hướng dẫn bên",
			"generate a list spanning a range of values": "tạo ra một danh sách vượt quá phạm vi giá trị",
			"identifier expected": "Phải là số nhận dạng",
			"identifier or variable expected": "Phải là số nhận dạng hoặc biến",
			"identifier or wildcard expected": "Phải có số nhận dạng hoặc ký tự vạn năng",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "Do float,don quá inline-block。 Nếu giá trị của 'float' không phải là 'none', khối sẽ trôi nổi và 'display' được coi là 'block'",
			"inlines a resource and falls back to 'url()'": "Nhúng tài nguyên và trả lời là 'url()'",
			"media query expected": "Phải có truy vấn phương tiện truyền thông",
			"number expected": "Phải là số",
			"operator expected": "Phải là toán tử",
			"page directive or declaraton expected": "cần page chỉ từ hoặc tuyên",
			"parses a string to a color": "Phân tích chuỗi thành màu sắc",
			"percentage expected": "phải có tỷ lệ phần trăm",
			"property value expected": "Trước đây phải là giá trị thuộc tính",
			"remove or change the unit of a dimension": "Các đơn vị loại bỏ hoặc thay đổi kích thước",
			"return '@color' 10% points darker": "trở lại '@color' sâu hơn 10% điểm",
			"return '@color' 10% points less saturated": "Trở lại '@color' độ bão hòa thấp hơn 10%",
			"return '@color' 10% points less transparent": "gửi lại '@color' độ trong suốt thấp hơn 10%",
			"return '@color' 10% points lighter": "gửi lại '@color' nông hơn 10% điểm",
			"return '@color' 10% points more saturated": "Trở lại '@color' độ bão hòa cao hơn 10%",
			"return '@color' 10% points more transparent": "Gửi lại '@color' minh bạch cao hơn 10%",
			"return '@color' with 50% transparency": "Tuyên trở lại với 50% minh bạch '@color'",
			"return '@color' with a 10 degree larger in hue": "Trở lại '@color' tông màu hơn 10 độ",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "Nếu `@color1 là> 43% luma` sẽ được truyền lại`@darkcolor`, nếu không nó sẽ được truyền lại",
			"return a mix of '@color1' và '@color2'": "Trở lại hỗn hợp của '@color1' và '@color2'",
			"returns a grey, 100% desaturated color": "trở lại màu xám, 100% khôi phục lại màu sắc bão hòa",
			"returns a value at the specified position in the list": "trả lại giá trị của vị trí được chỉ định trong danh sách",
			"returns one of two values depending on a condition.": "Theo điều kiện truyền trở lại một trong hai giá trị." ,
			"returns pi": "trả lại pi",
			"returns the `alpha` channel of `@color`": "Quay lại kênh `alpha` của@color`",
			"returns the `blue` channel of `@color`": "Quay trở lại kênh `blue` của@color`",
			"returns the 'green' channel of '@color'": "Gửi lại '@color' 'green' kênh",
			"returns the 'hue' channel of '@color' in the HSL space": "trở lại '@color' kênh trong không gian HSL",
			"returns the 'hue' channel of '@color' in the HSV space": "Trở lại kênh '@color' trong không gian HSV",
			"returns the 'lightness' channel of '@color' in the HSL space": "Trả lại '@color' kê",
			"returns the 'luma' value (perceptual brightness) of '@color'":"Gửi trở lại '@color' của 'luma' giá trị (nhận thức độ sáng)",
			"returns the 'red' channel of '@color'":"Trở lại '@color' 'red' kê",
			"returns the 'saturation' channel of '@color' in the HSL space": "Trở lại không gian HSL'@color' kê",
			"returns the 'saturation' channel of '@color' in the HSV space": "Trở lại HSV không gian'@color' kê",
			"returns the 'value' channel of '@color' in the HSV space": "Trở lại HSV không gian '@color' kênh",
			"returns the lowest of one or more values": "trở lại một hoặc nhiều giá trị thấp nhất",
			"returns the number of elements in a value list": "số lượng các yếu tố trong danh sách giá trị trả lại",
			"rounds a number to a number of places": "làm tròn các con số đến nhiều vị trí",
			"rounds down to an integer": "vô điều kiện bỏ đến số nguyên",
			"rounds up to an integer": "vô điều kiện vào vị trí đến số nguyên",
			"selector expected": "Phải có bộ chọn",
			"semi-colon expected": "Phải có dấu hai chấm",
			"sine function": "chức năng hình sin",
			"string literal expected": "phải là từ chuỗi thường giáp",
			"string replace": "chuỗi thay thế",
			"tangent function": "chức năng tích cực",
			"term expected": "Phải là từ",
			"unknown keyword": "từ khóa không rõ",
			"uri or string expected": "phải có URI hoặc từ chuỗi",
			"variable name expected": "Phải là tên biến số",
			"variable value expected": "Phải có giá trị thay đổi",
			"whitespace expected": "Phải là ký tự trống",
			"wildcard expected": "Phải có ký tự vạn năng." ,
			"{ expected": "phải là {",
			"{0}, '{1}'": "-{0}、'{1}'",
			"} expected": "Phải là }"
		},
		"package": {
			"description": "Cung cấp hỗ trợ ngôn ngữ tệp HTM và Handlebar phong phú",
			"displayName": "HTML Ngôn ngữ chức năng",
			"html.autoClosingTags": "Bật/tắt tính năng tự động tắt thẻ HTML." ,
			"html.autoCreateQuotes": "Kích hoạt/tắt HTML thuộc tính gán dấu ngoặc kép tự động thiết lập. Loại dấu ngoặc kép có thể được đặt bởi '#html.completion.attributeDefaultValue#'. ",
			"html.completion.attributeDefaultValue": "Kiểm soát giá trị mặc định thuộc tính khi chấp nhận hoàn tất." ,
			"html.completion.attributeDefaultValue.doublequotes": "Giá trị thuộc tính được đặt thành \"\"'",
			"html.completion.attributeDefaultValue.empty": "Giá trị thuộc tính không được đặt.",
			"html.completion.attributeDefaultValue.singlequotes": "Giá trị thuộc tính được đặt thành ''。",
			"html.customData.desc": "Danh sách đường dẫn tệp tương đối trỏ đến tệp JSON, sử dụng [định dạng dữ liệu tùy chỉnh] (https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code tải dữ liệu tùy chỉnh khi khởi động và tăng cường hỗ trợ HTML cho nhãn HTML tùy chỉnh, thuộc tính và giá trị thuộc tính mà bạn chỉ định trong tệp JSON. rnrn Đường dẫn lưu trữ liên quan đến không gian làm việc và chỉ xem xét cài đặt thư mục không gian ",
			"html.format.contentUnformatted.desc": "Danh sách các nhãn được phân tách bởi các dấu phẩy, trong đó định dạng của nội dung không nên được đặt lại. 'null' mặc định là thẻ 'pre'. ",
			"html.format.enable.desc": "Kích hoạt/tắt định dạng HTML mặc định." ,
			"html.format.extraLiners.desc": "Danh sách nhãn, dấu phẩy được tách ra, trước khi chúng nên thêm một\r thêm ký hiệu chi nhánh.\"'null' mặc định là '\"head, body, /html\"'. ",
			"html.format.indentHandlebars.desc": "Xây dựng và thu hẹp `{#foo}}` và `{/foo}}` `",
			"html.format.indentInnerHtml.desc": "Sẽ '<head>' và '<body> ' Phân khúc thu hẹp lại. ",
			"html.format.maxPreserveNewLines.desc": "Số lượng ký hiệu chi nhánh tối đa mà một khối muốn giữ lại. Sử dụng 'null' để có nghĩa là không giới hạn. ",
			"html.format.preserveNewLines.desc": "Kiểm soát có nên giữ lại biểu tượng chi nhánh ban đầu ở phía trước của phần tử hay không. Chỉ áp dụng ở phía trước của các yếu tố, không phải trong nhãn hoặc văn bản. ",
			"html.format.templating.desc": "tuân django、erb、handlebars 和 php phạm ben hóa ngôn ngữ tag." ,
			"html.format.unformatted.desc": "Danh sách các nhãn tách dấu phẩy không nên được định dạng lại. 'null' mặc định là tất cả các nhãn được liệt kê trong https://www.w3.org/TR/html5/dom.html#phrasing-content. ",
			"html.format.unformattedContentDelimiter.desc": "Giữ nội dung văn bản giữa các chuỗi này." ,
			"html.format.wrapAttributes.alignedmultiple": "Ngắt dòng khi vượt quá độ dài hàng và căn chỉnh các thuộc tính theo chiều dọc." ,
			"html.format.wrapAttributes.auto": "Chỉ ngắt thuộc tính khi vượt quá độ dài của hàng." ,
			"html.format.wrapAttributes.desc": "Hoán thuộc tính sang dòng." ,
			"html.format.wrapAttributes.force": "Trao đổi từng thuộc tính bên ngoài đầu tiên." ,
			"html.format.wrapAttributes.forcealign": "Ngắt dòng từng thuộc tính bên ngoài đầu tiên và giữ căn chỉnh.",
			"html.format.wrapAttributes.forcemultiline": "Thay đổi từng thuộc tính.",
			"html.format.wrapAttributes.preserve": "Giữ thuộc tính của hoán dòng.",
			"html.format.wrapAttributes.preservealigned": "Giữ thuộc tính hoán đổi hàng nhưng căn chỉnh",
			"html.format.wrapAttributesIndentSize.desc": "Sau khi thu nhỏ thuộc tính thành N ký tự. Sử dụng 'null' để sử dụng kích thước thụt lề mặc định. Nếu '#html.format.wrapAttributes#' được đặt thành 'aligned', nó sẽ được bỏ qua.",
			"html.format.wrapLineLength.desc": "Giới hạn trên của số lượng ký tự trên mỗi dòng (0 = vô hiệu hóa).",
			"html.hover.documentation": "Hiển thị nhãn và tệp thuộc tính khi được bảo lưu.",
			"html.hover.references": "Hiển thị tham chiếu MDN trong quá trình loại bỏ.",
			"html.mirrorCursorOnMatchingTag": "Bật/tắt con trỏ gương phù hợp với thẻ HTML." ,
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Bị loại vì 'editor.linkedEditing'",
			"html.suggest.html5.desc": "Kiểm soát xem hỗ trợ ngôn ngữ HTML tích hợp có được đề xuất nhãn, thuộc tính và giá trị HTML5 hay không." ,
			"html.trace.server.desc": "Theo dõi giao tiếp giữa VS Code và máy chủ ngôn ngữ HTML." ,
			"html.validate.scripts": "Thiết lập hỗ trợ ngôn ngữ HTML tích hợp để xác minh mã hướng dẫn nhúng." ,
			"html.validate.styles": "Thiết lập hỗ trợ ngôn ngữ HTML tích hợp có xác minh kiểu nhúng hay không."
		}
	}
}