{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "ví dụ",
			"Files by Extension": "Sắp xếp theo tên tập tin Phó",
			"Files with Extension": "Tên phó tài liệu lưu trữ",
			"Files with Multiple Extensions": "Các tệp có nhiều tên phụ",
			"Files with Path": "Đường dẫn tập tin",
			"Files with Siblings by Name": "Đã đến theo tên và cùng một mức độ của các tệp",
			"Folder by Name (Any Location)": "Thư mục được sắp xếp theo tên (bất kỳ vị trí nào)",
			"Folder by Name (Top Level)": "Thư mục được sắp xếp theo tên (lớp trên cùng)",
			"Folders with Multiple Names (Top Level)": "Một thư mục có nhiều tên (ở lớp trên cùng)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Tất cả các tệp phù hợp với đường dẫn lưu trữ phù hợp với chế độ Glob đường dẫn tuyệt đối tương ứng với ngôn ngữ có mã nhận dạng được chỉ định.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Tên tệp phù hợp với tất cả các tệp của chế độ GLOB, tương ứng với ngôn ngữ có mã nhận dạng được chỉ định.",
			"Match a folder with a specific name in any location.": "So sánh tất cả các vị trí với một tên cụ thể.",
			"Match a top level folder with a specific name.": "So sánh thư mục hàng đầu với một tên cụ thể.",
			"Match all files of a specific file extension.": "So sánh tất cả các tệp với một Sub -file cụ thể.",
			"Match all files with any of the file extensions.": "So sánh tất cả các tệp với bất kỳ Sub -file.",
			"Match files that have siblings with the same name but a different extension.": "So sánh các tệp cấp giống nhau với cùng tên nhưng tên bên lề khác nhau.",
			"Match multiple top level folders.": "So sánh nhiều thư mục trên.",
			"The character used by the operating system to separate components in file paths": "Hệ điều hành được sử dụng để phân tách thành phần của thành phần trong đường dẫn tệp",
			"The current opened file": "Các tệp đã được mở hiện tại",
			"The current opened file relative to ${workspaceFolder}": "Các tệp liên quan đến $ {WorkSpaceFolder} hiện đang mở",
			"The current opened file's basename": "Basename, đã mở kho lưu trữ",
			"The current opened file's basename with no file extension": "Basename, đã mở tệp, không bao gồm tên của bên lề",
			"The current opened file's dirname": "Dirname, đã mở kho lưu trữ",
			"The current opened file's dirname relative to ${workspaceFolder}": "So với $ {WorkSpaceFolder}, tệp Dirname đã được mở",
			"The current opened file's extension": "Tên phụ của kho lưu trữ hiện đang mở",
			"The current selected line number in the active file": "Số lượng hàng đã được chọn trong các tệp đang sử dụng",
			"The current selected text in the active file": "Văn bản hiện được chọn trong tệp đang sử dụng",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Tên của công việc xây dựng đặt trước.Nếu không có công việc xây dựng đặt trước, nó sẽ được hiển thị để chọn công việc xây dựng.",
			"The name of the folder opened in VS Code without any slashes (/)": "Tên thư mục đã được mở trong mã VS không bao gồm bất kỳ dòng xiên nào (/)",
			"The path of the folder opened in VS Code": "Đường dẫn thư mục đã được mở trong mã vs",
			"The path where an an extension is installed.": "Cài đặt đường dẫn của một mô -đun mở rộng.",
			"The task runner's current working directory on startup": "Thư mục làm việc hiện tại của bộ truyền động công việc hiện đang được bật",
			"Use the language of the currently active text editor if any": "Sử dụng ngôn ngữ trình soạn thảo văn bản hiện đang được sử dụng (nếu có)",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "Các ký hiệu phân tách có điều kiện (' -'), chỉ hiển thị khi nó có giá trị cho các biến trước và sau",
			"an indicator for when the active editor has unsaved changes": "Khi trình chỉnh sửa có một chỉ số về thay đổi không chuẩn bị",
			"e.g. SSH": "Ví dụ SSH",
			"e.g. VS Code": "Ví dụ VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "Đường dẫn tập tin khu vực làm việc (ví dụ/Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "Các đường dẫn lưu trữ được bao gồm trong khu vực làm việc (ví dụ /Users/Development/myFolder)",
			"gist": "Gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "Tên lưu trữ được bao gồm trong khu vực làm việc (ví dụ: MyFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "Nếu có thể (như MyFolder, MyRemoteFolder [SSH] hoặc MyWorksPace (không gian làm việc), đó là một tên nơi làm việc với tên từ xa có chọn lọc và khu vực làm việc của khu vực làm việc.",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "Tên rút ngắn của tên của mã đuôi (ví dụ: MyFolder hoặc MyWorkspace)",
			"the file name (e.g. myFile.txt)": "Tên lưu trữ (ví dụ: myfile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "Đường dẫn hoàn chỉnh của tệp (ví dụ /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "Đường dẫn đầy đủ của thư mục chứa tệp (ví dụ: /Users/Development/myFolder/myFileFolder)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "Tên của thư mục chứa tệp (chẳng hạn như myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "So với đường dẫn lưu trữ của thư mục khu vực làm việc (chẳng hạn nhưmyFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "Đường dẫn thư mục chứa các tài liệu lưu trữ, so với thư mục khu vực làm việc (chẳng hạn như myFolder/myFileFolder)"
		},
		"package": {
			"description": "Trong cài đặt, bắt đầu và các tệp mô hình hóa mở rộng như Lưu trữ như Lưu trữ, nó cung cấp các chức năng hiệu chỉnh IntelliSense và Tự động nâng cao.",
			"displayName": "Chỉnh sửa giá trị cài đặt"
		}
	}
}