{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"Lưu trữ \" Kiểm tra giá trị Blin để đánh giá trong bảo vệ hoặc if () sau đó.",
			"'from' expected": "Phải là 'from'.",
			"'in' expected": "Hy vọng 'in'",
			"'through' or 'to' expected": "cần phải 'through' hoặc 'to'",
			"'{0}'": "'{0}'",
			"( expected": "Hy vọng (",
			") expected": "Hy vọng )",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "@Quy tắc phông chữ phải xác định thuộc tính của 'SRC' và 'FONT-FEMILY'",
			"@keyframes {0}": "@KeyFrames {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Không có danh sách các thuộc tính được xác minh bằng cách xác minh quy tắc của `UnknownProperies`.",
			"Adds quotes to a string.": "Đã thêm dấu ngoặc kép vào chuỗi.",
			"Also define the standard property '{0}' for compatibility": "Nó cũng xác định các thuộc tính tiêu chuẩn '{0}' để có được khả năng tương thích",
			"Always define standard rule '@keyframes' when defining keyframes.": "Khi xác định các khung khóa chính, các quy tắc tiêu chuẩn sẽ được xác định '@KeyFrames'.",
			"Always include all vendor specific properties: Missing: {0}": "Tất cả bao gồm tất cả các thuộc tính cụ thể của nhà sản xuất: Mất: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Tất cả bao gồm tất cả các quy tắc cụ thể của nhà sản xuất: Mất: {0}",
			"Appends a single value onto the end of a list.": "Đính kèm một giá trị duy nhất vào cuối danh sách.",
			"Appends selectors to one another without spaces in between.": "Gắn thiết bị đã chọn với nhau, nhưng không có khoảng trống giữa hai.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Tránh sử dụng! Quan trọng.Điều này có nghĩa là toàn bộ việc làm rõ CSS nằm ngoài tầm kiểm soát và đòi hỏi phải tái thiết.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Tránh sử dụng 'float'.Nổi sẽ làm cho CSS dễ vỡ và dễ bị gián đoạn khi bất kỳ mức độ nào của cấu hình bố cục được thay đổi.",
			"CSS Language Server": "Máy chủ ngôn ngữ CSS",
			"CSS fix is outdated and can\\'t be applied to the document.": "Việc điều chỉnh CSS đã hết hạn và không thể được áp dụng cho tệp.",
			"Causes one or more rules to be emitted at the root of the document.": "Do đó, một hoặc nhiều quy tắc được ban hành trong thư mục gốc tệp.",
			"Changes one or more properties of a color.": "Một hoặc nhiều thuộc tính để thay đổi màu sắc.",
			"Changes the alpha component for a color.": "Thay đổi thành phần alpha màu.",
			"Changes the hue of a color.": "Thay đổi màu màu.",
			"Combines several lists into a single multidimensional list.": "Hợp nhất một số danh sách thành danh sách đơn lẻ.",
			"Converts a color into the format understood by IE filters.": "Chuyển đổi màu sang định dạng có thể được hiểu bằng cách sàng lọc IE.",
			"Converts a color to grayscale.": "Chuyển đổi màu sang màu xám.",
			"Converts a string to lower case.": "Chuyển đổi chuỗi thành chữ thường.",
			"Converts a string to upper case.": "Chuyển đổi chuỗi thành chữ hoa.",
			"Converts a unitless number to a percentage.": "Chuyển đổi số mà không có đơn vị thành tỷ lệ phần trăm.",
			"Creates a Color from hue, saturation, and lightness values.": "Tạo màu từ tông màu, độ bão hòa và độ sáng.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Thiết lập màu sắc từ tông màu, độ bão hòa, độ sáng và giá trị alpha.",
			"Creates a Color from hue, white and black.": "Tạo màu từ màu sắc, trắng và đen.",
			"Creates a Color from red, green, and blue values.": "Tạo màu từ màu đỏ, xanh lá cây và xanh dương.",
			"Creates a Color from red, green, blue, and alpha values.": "Thiết lập màu sắc từ các giá trị màu đỏ, xanh lá cây, xanh dương và alpha.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Xác định bài tập về nhà phức tạp có thể được tái sử dụng trong bảng kiểu.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Xác định kiểu có thể được sử dụng lại trong toàn bộ bảng kiểu với '@include'.",
			"Do not use duplicate style definitions": "Không sử dụng các định nghĩa kiểu lặp đi lặp lại",
			"Do not use empty rulesets": "Không sử dụng bộ quy tắc trống",
			"Do not use width or height when using padding or border": "sử dụng padding hoặc border Đừng sử dụng thời gian width hoặc height。",
			"Dynamically calls a Sass function.": "Cuộc gọi động chức năng Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Đặt '$var' thành danh sách hoặc mỗi mục trong tương ứng, sau đó xuất ra kiểu có trong giá trị '$var'.",
			"Exposes the details of Sass’s inner workings.": "Thông tin chi tiết về công việc nội bộ của SASS.",
			"Extends $extendee with $extender within $selector.": "sử dụng $selector bên trong $extender mở rộng $extendee。",
			"Extracts a substring from $string.": "Gửi phụ -Chuỗi từ $String.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Việc điều chỉnh CSS không thể được áp dụng cho tệp.Vui lòng xem xét bắt đầu vấn đề xuất hiện lại các bước.",
			"Finds the maximum of several numbers.": "Tìm giá trị tối đa của một số số.",
			"Finds the minimum of several numbers.": "Tìm giá trị tối thiểu của một số số.",
			"Fluidly scales one or more properties of a color.": "Một hoặc nhiều thuộc tính được chia tỷ lệ trơn tru.",
			"Folding Region End": "Kết thúc khu vực gấp",
			"Folding Region Start": "Khu vực gấp bắt đầu",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Đối với mỗi '$var' trong mệnh đề `from/through` hoặc from/to`, hãy lặp lại đầu ra của một nhóm các kiểu.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Theo các màu hiện có, chủ đề màu sắc dễ dàng được xây dựng.",
			"Gets the blue component of a color.": "Nhận các yếu tố màu xanh đầy màu sắc.",
			"Gets the green component of a color.": "Nhận các yếu tố màu xanh lá cây đầy màu sắc.",
			"Gets the hue component of a color.": "Nhận các thành phần màu màu.",
			"Gets the lightness component of a color.": "Nhận phần tử độ sáng màu.",
			"Gets the opacity component of a color.": "Nhận phần tử mờ màu.",
			"Gets the red component of a color.": "Nhận các thành phần màu đỏ đầy màu sắc.",
			"Gets the saturation component of a color.": "Nhận các thành phần đầy màu sắc.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Mười sáu màu sắc phải bao gồm ba, bốn, sáu hoặc tám số thập lục phân",
			"IE hacks are only necessary when supporting IE7 and older": "只IEE hack chỉ cần hỗ trợ IE7 và các phiên bản cũ hơn",
			"Import statements do not load in parallel": "Câu lệnh tuyên bố sẽ không được tải song song",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Nếu kết quả tính toán của công thức hoạt động không phải là 'false' hoặc 'null', thì nó chứa chủ đề.",
			"Includes the styles defined by another mixin into the current rule.": "Chứa một định nghĩa mixen khác cho các quy tắc hiện tại.",
			"Increases or decreases one or more components of a color.": "Tăng hoặc giảm một hoặc nhiều thành phần màu sắc.",
			"Inherits the styles of another selector.": "Kế thừa phong cách của một bộ chọn khác.",
			"Inserts $insert into $string at $index.": "chèn $insert tại $index vào $string。",
			"Invalid number of parameters": "Số tham số không hợp lệ",
			"Joins together two lists into one.": "Kết hợp hai danh sách vào một danh sách.",
			"Lets you access and modify values in lists.": "Cho phép bạn truy cập và sửa đổi giá trị trong danh sách.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Tải bảng kiểu SASS. Khi bảng kiểu này được tải với các quy tắc @USE, sử dụng mixin, chức năng và biến của nó.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Trong tương lai, mixin, công thức và các biến được tải dưới dạng 'mô-đun' từ các bảng kiểu Sass khác và CSS với nhiều bảng kiểu được kết hợp.",
			"Makes a color darker.": "Làm cho màu sắc sâu hơn.",
			"Makes a color less saturated.": "Làm cho màu ít bão hòa.",
			"Makes a color lighter.": "Làm cho màu sáng hơn.",
			"Makes a color more opaque.": "Làm cho màu trong suốt hơn.",
			"Makes a color more saturated.": "Làm cho màu sắc bão hòa hơn.",
			"Makes a color more transparent.": "Làm cho màu trong suốt hơn.",
			"Makes it easy to combine, search, or split apart strings.": "Dễ dàng hợp nhất, tìm kiếm hoặc chia chuỗi.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Có nhiều chức năng cho phép bạn truy vấn giá trị liên quan đến giá trị của các khóa chỉ mục trong tương ứng.",
			"Merges two maps together into a new map.": "Hợp nhất hai bản đồ vào một bản đồ mới.",
			"Mixes two colors together.": "Trộn hai màu với nhau.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Nest được định hình bởi thiết bị đã chọn giống như xây dựng một hình dạng tổ trong bảng kiểu.",
			"No unit for zero needed": "Không cần đơn vị cho số không",
			"Parses a selector into the format returned by &.": "Phân tích thiết bị đã chọn theo định dạng của Return được truyền bởi &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "In giá trị điện toán vào luồng dữ liệu đầu ra lỗi tiêu chuẩn.Thích hợp cho các tập tin SASS phức tạp.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Đầu ra Giá trị điện toán vào luồng dữ liệu đầu ra lỗi tiêu chuẩn.Nó phù hợp cho sự cần thiết phải cảnh báo người dùng loại bỏ hoặc sử dụng mixin thứ hai để sử dụng khôi phục lỗi.Bạn có thể sử dụng tùy chọn cột lệnh '--quiet' hoặc `: Tùy chọn SEM SASS để đóng cảnh báo.",
			"Property is ignored due to the display.": "Do các lý do được hiển thị, thuộc tính đã nhiều hơn một chút so với thuộc tính.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Do màn hình, nó đã bị bỏ qua.Đối với 'Hiển thị: khối', không nên căn chỉnh dọc.",
			"Provides access to Sass’s powerful selector engine.": "Cung cấp một động cơ lựa chọn mạnh mẽ để truy cập SASS.",
			"Provides functions that operate on numbers.": "Cung cấp chức năng cho các hoạt động kỹ thuật số.",
			"Removes quotes from a string.": "Hủy bỏ các trích dẫn trong chuỗi.",
			"Rename to '{0}'": "Đổi tên '{0}'",
			"Replaces $original with $replacement within $selector.": "thay thế $original Bên trong $replacement phạm vi $selector",
			"Replaces the nth item in a list.": "Thay thế dự án n trong danh sách.",
			"Returns a list of all keys in a map.": "Quay trở lại danh sách tất cả các khóa chỉ mục trong tương ứng.",
			"Returns a list of all values in a map.": "Quay trở lại danh sách tất cả các giá trị trong tương ứng.",
			"Returns a new map with keys removed.": "Sự tương ứng mới được thông qua và chỉ số được loại bỏ.",
			"Returns a random number.": "Giảm giá hỗn loạn.",
			"Returns a specific item in a list.": "Quay trở lại một mục cụ thể trong danh sách.",
			"Returns the absolute value of a number.": "Giá trị tuyệt đối của số số.",
			"Returns the complement of a color.": "Thuốc bổ cho màu.",
			"Returns the index of the first occurance of $substring in $string.": "quay lại  $string của $substring chỉ số dự án đầu tiên",
			"Returns the inverse of a color.": "Chức năng ngược chức năng chống chức năng.",
			"Returns the keywords passed to a function that takes variable arguments.": "Đổ trở lại các từ khóa sử dụng hàm số nguyên nhân biến.",
			"Returns the length of a list.": "Quay lại chiều dài của danh sách.",
			"Returns the number of characters in a string.": "Số lượng ký tự trong chuỗi từ",
			"Returns the position of a value within a list.": "Giá trị trả về nằm trong danh sách.",
			"Returns the separator of a list.": "Biểu tượng tách của danh sách.",
			"Returns the simple selectors that comprise a compound selector.": "Bộ chọn đơn giản của thiết bị lựa chọn tổng hợp được trả về.",
			"Returns the string representation of a value as it would be represented in Sass.": "Chuỗi giá trị trở lại được biểu thị trong SASS.",
			"Returns the type of a value.": "Loại giá trị trả lại.",
			"Returns the unit(s) associated with a number.": "Quay lại các đơn vị liên quan đến số.",
			"Returns the value in a map associated with a given key.": "Giá trị tương ứng với mã biểu tượng được chỉ định được truyền lại.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Liệu $Super có phù hợp với tất cả các yếu tố đáp ứng $Sub hay không và liệu nó có đáp ứng nhiều hơn không.",
			"Returns whether a feature exists in the current Sass runtime.": "Liệu chức năng sao lưu tồn tại trong giai đoạn thực hiện SASS hiện tại.",
			"Returns whether a function with the given name exists.": "Cho dù chức năng với một tên được chỉ định tồn tại.",
			"Returns whether a map has a value associated with a given key.": "Liệu giá trị tương ứng có liên quan đến các khóa chỉ mục được chỉ định hay không.",
			"Returns whether a mixin with the given name exists.": "Cho dù mixin với một tên cụ thể tồn tại.",
			"Returns whether a number has units.": "Cho dù có một đơn vị cho số lượng.",
			"Returns whether a variable with the given name exists in the current scope.": "Cho dù các biến có tên được chỉ định tồn tại trong phạm vi hiện tại.",
			"Returns whether a variable with the given name exists in the global scope.": "Cho dù các biến có tên được chỉ định tồn tại trong toàn bộ khu vực.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Cho dù hai số có thể được thêm vào, giảm hoặc so sánh.",
			"Rounds a number down to the previous whole number.": "Cho các số vô điều kiện cho số nguyên trước đó.",
			"Rounds a number to the nearest whole number.": "Cung cấp các số cho số nguyên gần nhất.",
			"Rounds a number up to the next whole number.": "Nhập số vô điều kiện vào số nguyên tiếp theo.",
			"Sass documentation": "Sass tài liệu",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Thiết bị đã chọn không nên bao gồm ID vì các quy tắc này quá gần với HTML.",
			"The universal selector (*) is known to be slow": "Được biết rằng thiết bị lựa chọn chung (*) chậm",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Ném giá trị tính toán như một lỗi nghiêm trọng để theo dõi xếp chồng.Để xác minh Mixin 和函數的引數很有用。",
			"URI expected": "Kỳ vọng là URI",
			"URL encodes a string": "Chuỗi mã hóa URL",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Hai bộ chọn để tạo ra người chọn phù hợp với các yếu tố phù hợp với hai phần tử.",
			"Unknown at-rule.": "Không rõ quy tắc.",
			"Unknown property.": "Thuộc tính không xác định.",
			"Unknown property: '{0}'": "Thuộc tính không xác định: '{0}'",
			"Unknown vendor specific property.": "Các thuộc tính cụ thể của nhà sản xuất không xác định.",
			"When using a vendor-specific prefix also include the standard property": "Khi sử dụng tiền tố độc quyền của nhà sản xuất, nó cũng bao gồm các thuộc tính tiêu chuẩn",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Khi sử dụng tiền tố độc quyền của nhà sản xuất, vui lòng xác định rằng nó cũng bao gồm các thuộc tính độc quyền của tất cả các nhà sản xuất khác",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "While Vòng lặp sẽ được tính toán và liên tục xuất kiểu tổ cho đến khi câu lệnh được đánh giá là 'false'.",
			"[ expected": "Hy vọng [",
			"[Selector Specificity](https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity): ({0}, {1}, {2})": "[Đã chọn thiết bị xóa] (https://developer.mozilla.org/en-s/docs/web/css/specification): ({0}, {1}, {2})))",
			"] expected": "cần phải ]",
			"absolute value of a number": "Giá trị tuyệt đối của số",
			"arccosine - inverse of cosine function": "Anti -Hàm cosin",
			"arcsine - inverse of sine function": "Một cách khó khăn -reverse của chức năng sine",
			"arctangent - inverse of tangent function": "Dù sao -ngược lại chức năng tích cực",
			"argument from \\'{0}\\'": "Biểu thức từ \\'{0}\\'",
			"at-rule or selector expected": "Nó được dự kiến ​​sẽ là at-Rule hoặc bộ chọn",
			"at-rule unknown": "quy tắc không xác định ",
			"bind the evaluation of a ruleset to each member of a list.": "Biến đánh giá của tập hợp thông thường với từng thành viên trong danh sách.",
			"calculates square root of a number": "Tính toán căn bậc hai của số",
			"colon expected": "Phải là một số giả mạo",
			"comma expected": "Phải là dấu phẩy",
			"condition expected": "Phải là một điều kiện",
			"converts numbers from one type into another": "Chuyển đổi số từ loại này sang loại khác",
			"converts to a %, e.g. 0.5 > 50%": "Chuyển đổi thành %, ví dụ, 0,5> 50 %",
			"cosine function": "Chức năng Hàm cosin",
			"creates a #AARRGGBB": "Thành lập #AARRGGBB",
			"creates a color": "Xây dựng màu sắc",
			"dot expected": "Phải là điểm",
			"escape string content": "Thêm nội dung chuỗi",
			"expression expected": "Phải là một công thức hoạt động",
			"first argument modulus second argument": "Số lượng các cặp khoang đầu tiên của khoang thứ hai có sẵn",
			"first argument raised to the power of the second argument": "Đối số đầu tiên được đưa ra cho sức mạnh của đối số thứ hai",
			"generate a list spanning a range of values": "Một danh sách các phạm vi giá trị giao nhau",
			"identifier expected": "Phải là mã công nhận",
			"identifier or variable expected": "Kỳ vọng là mã công nhận hoặc biến",
			"identifier or wildcard expected": "Phải được xác định mã hoặc ký tự phổ quát",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block bị bỏ qua do khóa. Nếu 'float' có một giá trị khác với 'none', Hộp được thả nổi và 'display' được coi là 'block'",
			"inlines a resource and falls back to `url()`": "Nhúng tài nguyên và trả lời 'url()'",
			"media query expected": "Kỳ vọng như một cuộc điều tra truyền thông",
			"number expected": "Phải là số",
			"operator expected": "Phải là một nhà điều hành",
			"page directive or declaraton expected": "Kỳ vọng như một chỉ báo trang hoặc khai báo",
			"parses a string to a color": "Phân tích chuỗi dưới dạng màu",
			"percentage expected": "Dự kiến ​​sẽ là tỷ lệ phần trăm",
			"property value expected": "Nó được dự kiến ​​là giá trị thuộc tính",
			"remove or change the unit of a dimension": "Các đơn vị loại bỏ hoặc thay đổi kích thước",
			"return `@color` 10% points darker": "Quay trở lại '@Color' sâu hơn 10%",
			"return `@color` 10% points less saturated": "Trả lại '@Color' ít bão hòa hơn 10%",
			"return `@color` 10% points less transparent": "Độ trong suốt thấp hơn 10% là 10% `@color`",
			"return `@color` 10% points lighter": "Trả lại '@Color' là 10% điểm nhẹ hơn 10%",
			"return `@color` 10% points more saturated": "Trả lại '@Color' cao 10% bão hòa",
			"return `@color` 10% points more transparent": "Trả lại mức độ minh bạch cao 10% '@Color' cao 10%",
			"return `@color` with 50% transparency": "Trả về `@color` với độ minh bạch 50%",
			"return `@color` with a 10 degree larger in hue": "Màu của màu là 10 độ là 10 độ `@color`",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "Nếu `@color1 là> 43% luma` sẽ được truyền lại`@darkcolor`, nếu không nó sẽ được truyền lại",
			"return a mix of `@color1` and `@color2`": "Quay lại sự pha trộn của `@color1` và`@color2`",
			"returns a grey, 100% desaturated color": "Khóa học màu xám, phục hồi 100% màu bão hòa",
			"returns a value at the specified position in the list": "Giá trị của vị trí được chỉ định trong danh sách",
			"returns one of two values depending on a condition.": "Purnish một trong hai giá trị theo các điều kiện.",
			"returns pi": "returns pi",
			"returns the `alpha` channel of `@color`": "Quay lại kênh `alpha` của@color`",
			"returns the `blue` channel of `@color`": "Quay trở lại kênh `blue` của@color`",
			"returns the `green` channel of `@color`": "Trả lại cho kênh `` Green` của@color`",
			"returns the `hue` channel of `@color` in the HSL space": "Quay lại kênh 'Hue' của '@Color' trong không gian HSL",
			"returns the `hue` channel of `@color` in the HSV space": "Kênh 'Hue' của '@Color' trong không gian HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "Quay lại các kênh HSL không gian `` Lightness 'của@color`",
			"returns the `luma` value (perceptual brightness) of `@color`": "Quay lại giá trị 'Luma' của '@Color' (độ sáng nhận thức)",
			"returns the `red` channel of `@color`": "Quay lại kênh `Red` của @color`",
			"returns the `saturation` channel of `@color` in the HSL space": "Quay lại kênh 'Saturation` của' @Color 'trong không gian HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "Quay lại không gian HSV `` Saturation` của@color`",
			"returns the `value` channel of `@color` in the HSV space": "Kênh `value` của '@Color' trong không gian HSV",
			"returns the lowest of one or more values": "Giá trị tối thiểu của một hoặc nhiều giá trị",
			"returns the number of elements in a value list": "Số lượng phần tử trong danh sách giá trị",
			"rounds a number to a number of places": "Giữ số vào nhiều vị trí",
			"rounds down to an integer": "Ngôi nhà vô điều kiện đến số nguyên",
			"rounds up to an integer": "Điều kiện để số nguyên",
			"selector expected": "Phải là một bộ chọn",
			"semi-colon expected": "Phải là một số giả mạo",
			"sine function": "Chức năng sin",
			"string literal expected": "Phải là một giá trị định mức chuỗi",
			"string replace": "Thay thế chuỗi",
			"tangent function": "Chức năng cắt tích cực",
			"term expected": "Phải là một từ",
			"unknown keyword": "Từ khóa không xác định",
			"uri or string expected": "Kỳ vọng là URI hoặc Chuỗi",
			"variable name expected": "Phải là một tên biến",
			"variable value expected": "Phải là các giá trị biến",
			"whitespace expected": "Phải trống",
			"wildcard expected": "Nó được dự kiến ​​sẽ là một đồng hồ vạn năng",
			"{ expected": "cần phải {",
			"{0}, '{1}'": "{0}、'{1}'",
			"} expected": "cần phải }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "Đặt `CSS.Colordecorators.nable` đã bị loại bỏ và thay đổi thành` biên tập viên.Colordecorators`.",
			"css.completion.completePropertyWithSemicolon.desc": "Khi hoàn thành thuộc tính CSS, chèn điểm ở cuối dòng.",
			"css.completion.triggerPropertyValueCompletion.desc": "Theo cài đặt trước, mã VS sẽ được kích hoạt sau khi chọn thuộc tính CSS để hoàn thành giá trị thuộc tính.Vui lòng sử dụng cài đặt này để ngăn chặn hành vi này.",
			"css.customData.desc": "Chỉ vào danh sách đường dẫn tệp tương đối của tệp JSON, [Định dạng dữ liệu tự đặt hàng] (https://github.com/microsoft/vscode-css-langageervice/blob/master/docs/cusomdata.md).Mã\r\n\r\nVS sẽ tải dữ liệu tùy chỉnh tại thời điểm bắt đầu. Đối với các thuộc tính CSS tùy chỉnh, tại các chỉ dẫn, danh mục ảo và các yếu tố ảo được chỉ định trong tệp JSON để tăng cường hỗ trợ CSS của nó.\r\n\r\nthe đường dẫn tệp liên quan đến khu vực làm việc và chỉ cần xem xét cài đặt thư mục khu vực làm việc.",
			"css.format.braceStyle.desc": "Đặt vòng cung khung trong cùng một dòng với các quy tắc ('collapse') hoặc đặt giá đỡ trên đường của riêng bạn (`expand`).",
			"css.format.enable.desc": "Bật/ngừng định dạng CSS mặc định.",
			"css.format.maxPreserveNewLines.desc": "Khi bạn bật '#CSS.Format.PreservenewLines#', số lượng biểu tượng chi nhánh trong một khối phải được giữ lại.",
			"css.format.newlineBetweenRules.desc": "Chia các quy tắc được đặt với các dòng trống.",
			"css.format.newlineBetweenSelectors.desc": "Xem thiết bị lựa chọn với một dòng mới.",
			"css.format.preserveNewLines.desc": "Nếu biểu tượng nhánh hiện có trước khi phần tử nên được giữ lại.",
			"css.format.spaceAroundSelectorSeparator.desc": "Vui lòng xác nhận rằng thiết bị lựa chọn được phân tách bằng từ ','+','~'có các ký tự trống xung quanh (ví dụ:` a> b`).",
			"css.hover.documentation": "Hiển thị nhãn và tệp thuộc tính khi lưu giữ CSS.",
			"css.hover.references": "Tham chiếu MDN được hiển thị tạm thời trong CSS.",
			"css.lint.argumentsInColorFunction.desc": "Số lượng tham số lỗi.",
			"css.lint.boxModel.desc": "Không sử dụng 'width' hoặc 'height' khi sử dụng 'padding' hoặc 'border'.",
			"css.lint.compatibleVendorPrefixes.desc": "Khi sử dụng Prelude độc ​​quyền của nhà sản xuất, người ta xác định rằng nó cũng bao gồm tất cả các thuộc tính độc quyền của các nhà sản xuất khác. ",
			"css.lint.duplicateProperties.desc": "Không sử dụng định nghĩa phong cách lặp đi lặp lại. ",
			"css.lint.emptyRules.desc": "Không sử dụng bộ quy tắc trống.",
			"css.lint.float.desc": "Tránh sử dụng 'float'.Nổi sẽ làm cho CSS dễ vỡ và dễ bị gián đoạn khi bất kỳ mức độ nào của cấu hình bố cục được thay đổi.",
			"css.lint.fontFaceProperties.desc": "@font-face` Quy tắc phải xác định các thuộc tính của` src` và `font-family`.",
			"css.lint.hexColorLength.desc": "Mười sáu màu sắc phải bao gồm ba hoặc sáu vị trí thập lục phân.",
			"css.lint.idSelector.desc": "Thiết bị đã chọn không nên bao gồm ID vì các quy tắc này quá gần với HTML.",
			"css.lint.ieHack.desc": "IE hack chỉ được yêu cầu khi hỗ trợ các phiên bản IE7 và cũ hơn.",
			"css.lint.importStatement.desc": "Các câu lệnh nhập cảnh sẽ không được tải song song.",
			"css.lint.important.desc": "Tránh sử dụng '! Quan trọng'.Điều này có nghĩa là toàn bộ việc làm rõ CSS nằm ngoài tầm kiểm soát và đòi hỏi phải tái thiết.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Thuộc tính bị bỏ qua bởi các mối quan hệ được hiển thị. Ví dụ: 'display: inline' sẽ làm cho các thuộc tính  'width', 'height', 'margin-top', 'margin-bottom' và 'float' không hợp lệ. ",
			"css.lint.universalSelector.desc": "Được biết, người chọn chung (`*`) là chậm.",
			"css.lint.unknownAtRules.desc": "Không rõ quy tắc.",
			"css.lint.unknownProperties.desc": "Thuộc tính không xác định.",
			"css.lint.unknownVendorSpecificProperties.desc": "Các thuộc tính cụ thể của nhà sản xuất không xác định.",
			"css.lint.validProperties.desc": "Không có danh sách các thuộc tính được xác minh bằng cách xác minh quy tắc của `UnknownProperies`.",
			"css.lint.vendorPrefix.desc": "Khi sử dụng tiền tố độc quyền của nhà sản xuất, nó cũng bao gồm các thuộc tính tiêu chuẩn.",
			"css.lint.zeroUnits.desc": "Không có nhu cầu cho bất kỳ đơn vị.",
			"css.title": "CSS",
			"css.trace.server.desc": "Theo dõi giao tiếp giữa mã VS và máy chủ ngôn ngữ CSS.",
			"css.validate.desc": "Bật hoặc ngừng tất cả các xác minh.",
			"css.validate.title": "Kiểm soát xác minh CSS và các vấn đề nghiêm trọng.",
			"description": "Cung cấp hỗ trợ ngôn ngữ phong phú cho các tệp CSS, LESS và SCSS ",
			"displayName": "Hàm ngôn ngữ CSS",
			"less.colorDecorators.enable.deprecationMessage": "Cài đặt `less.colorDecorators.enable`đã bị loại bỏ và thay đổi thành `editor.colorDecorators`",
			"less.completion.completePropertyWithSemicolon.desc": "Khi hoàn thành thuộc tính CSS, chèn điểm ở cuối dòng.",
			"less.completion.triggerPropertyValueCompletion.desc": "Theo cài đặt trước, mã VS sẽ được kích hoạt sau khi chọn thuộc tính CSS để hoàn thành giá trị thuộc tính.Vui lòng sử dụng cài đặt này để ngăn chặn hành vi này.",
			"less.format.braceStyle.desc": "Đặt dấu ngoặc đơn trên cùng một dòng với quy tắc ('collapse') hoặc đặt dấu ngoặc đơn trên dòng của riêng bạn (`expand`). ",
			"less.format.enable.desc": "Bật/ngừng định dạng ít mặc định.",
			"less.format.maxPreserveNewLines.desc": "Khi bạn bật '#Less.Format.PreservenewLines#', số lượng biểu tượng nhánh trong một khối sẽ được giữ lại.",
			"less.format.newlineBetweenRules.desc": "Chia các quy tắc được đặt với các dòng trống.",
			"less.format.newlineBetweenSelectors.desc": "Xem thiết bị lựa chọn với một dòng mới.",
			"less.format.preserveNewLines.desc": "Nếu biểu tượng nhánh hiện có trước khi phần tử nên được giữ lại.",
			"less.format.spaceAroundSelectorSeparator.desc": "Vui lòng xác nhận rằng thiết bị lựa chọn được phân tách bằng từ ','+','~'có các ký tự trống xung quanh (ví dụ:` a> b`).",
			"less.hover.documentation": "Hiển thị nhãn và tệp thuộc tính khi ít được bảo lưu tạm thời.",
			"less.hover.references": "Tham chiếu MDN được hiển thị tạm thời khi ít được bảo lưu.",
			"less.lint.argumentsInColorFunction.desc": "Số lượng tham số lỗi.",
			"less.lint.boxModel.desc": "Sử dụng 'width' hoặc 'height' khi sử dụng 'padding' hoặc 'border'.",
			"less.lint.compatibleVendorPrefixes.desc": "Khi sử dụng Prelude độc ​​quyền của nhà sản xuất, người ta xác định rằng nó cũng bao gồm tất cả các thuộc tính độc quyền của các nhà sản xuất khác. ",
			"less.lint.duplicateProperties.desc": "Không sử dụng định nghĩa phong cách lặp đi lặp lại. ",
			"less.lint.emptyRules.desc": "Không sử dụng bộ quy tắc trống.",
			"less.lint.float.desc": "Tránh sử dụng 'float'.Nổi sẽ làm cho CSS dễ vỡ và dễ bị gián đoạn khi bất kỳ mức độ nào của cấu hình bố cục được thay đổi.",
			"less.lint.fontFaceProperties.desc": "Các quy tắc `@font-face` phải xác định các thuộc tính của `src` và `font-family`.",
			"less.lint.hexColorLength.desc": "Mười sáu màu sắc phải bao gồm ba hoặc sáu vị trí thập lục phân.",
			"less.lint.idSelector.desc": "Thiết bị đã chọn không nên bao gồm ID vì các quy tắc này quá gần với HTML.",
			"less.lint.ieHack.desc": "IE hack chỉ được yêu cầu khi hỗ trợ các phiên bản IE7 và cũ hơn.",
			"less.lint.importStatement.desc": "Các câu lệnh nhập cảnh sẽ không được tải song song.",
			"less.lint.important.desc": "Tránh sử dụng '!important'.Điều này có nghĩa là toàn bộ việc làm rõ CSS nằm ngoài tầm kiểm soát và đòi hỏi phải tái thiết.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Thuộc tính được bỏ qua vì mối quan hệ hiển thị.Ví dụ: 'display: inline' sẽ tạo ra 'width', 'height', 'margin-top', 'margin-bottom' và 'float' thuộc tính không hợp lệ.",
			"less.lint.universalSelector.desc": "Được biết, người chọn chung (`*`) là chậm.",
			"less.lint.unknownAtRules.desc": "Không rõ quy tắc.",
			"less.lint.unknownProperties.desc": "Thuộc tính không xác định.",
			"less.lint.unknownVendorSpecificProperties.desc": "Các thuộc tính cụ thể của nhà sản xuất không xác định.",
			"less.lint.validProperties.desc": "Không có danh sách các thuộc tính được xác minh bằng cách xác minh quy tắc của `UnknownProperies`.",
			"less.lint.vendorPrefix.desc": "Khi sử dụng tiền tố độc quyền của nhà sản xuất, nó cũng bao gồm các thuộc tính tiêu chuẩn.",
			"less.lint.zeroUnits.desc": "Không có nhu cầu cho bất kỳ đơn vị.",
			"less.title": "LESS",
			"less.validate.desc": "Bật hoặc ngừng tất cả các xác minh.",
			"less.validate.title": "Kiểm soát ít xác minh và nghiêm túc hơn.",
			"scss.colorDecorators.enable.deprecationMessage": "Đặt `SCSS.Colordecorators.Enable` để bị loại và thay đổi thành` Editor.Colordecorators`.",
			"scss.completion.completePropertyWithSemicolon.desc": "Khi hoàn thành thuộc tính CSS, chèn điểm ở cuối dòng.",
			"scss.completion.triggerPropertyValueCompletion.desc": "Theo cài đặt trước, mã VS sẽ được kích hoạt sau khi chọn thuộc tính CSS để hoàn thành giá trị thuộc tính.Vui lòng sử dụng cài đặt này để ngăn chặn hành vi này.",
			"scss.format.braceStyle.desc": "Đặt giá đỡ trong cùng một dòng với các quy tắc ('sụp đổ') hoặc đặt giá đỡ trên dòng của riêng bạn (`mở rộng ').",
			"scss.format.enable.desc": "Bật/Dừng định dạng SCSS trước.",
			"scss.format.maxPreserveNewLines.desc": "Khi bạn bật '#SCSS.Format.PreservenewLines#', nên giữ lại số lượng biểu tượng chi nhánh trong một khối.",
			"scss.format.newlineBetweenRules.desc": "Chia các quy tắc được đặt với các dòng trống.",
			"scss.format.newlineBetweenSelectors.desc": "Xem thiết bị lựa chọn với một dòng mới.",
			"scss.format.preserveNewLines.desc": "Nếu biểu tượng nhánh hiện có trước khi phần tử nên được giữ lại.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Vui lòng xác nhận rằng thiết bị lựa chọn được phân tách bằng từ ','+',' ~ 'có các ký tự trống xung quanh (ví dụ:` a> b`).",
			"scss.hover.documentation": "Hiển thị nhãn và tệp thuộc tính khi SCSS được bảo lưu tạm thời.",
			"scss.hover.references": "Tham chiếu MDN được hiển thị tạm thời tại SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "Số lượng tham số lỗi.",
			"scss.lint.boxModel.desc": "使用 'padding' 或 'border' 時不要使用 'width' 或 'height'。",
			"scss.lint.compatibleVendorPrefixes.desc": "Khi sử dụng Prelude độc ​​quyền của nhà sản xuất, người ta xác định rằng nó cũng bao gồm tất cả các thuộc tính độc quyền của các nhà sản xuất khác. ",
			"scss.lint.duplicateProperties.desc": "Không sử dụng định nghĩa phong cách lặp đi lặp lại. ",
			"scss.lint.emptyRules.desc": "Không sử dụng bộ quy tắc trống.",
			"scss.lint.float.desc": "Tránh sử dụng 'float'.Nổi sẽ làm cho CSS dễ vỡ và dễ bị gián đoạn khi bất kỳ mức độ nào của cấu hình bố cục được thay đổi.",
			"scss.lint.fontFaceProperties.desc": "`@font-face` quy tắc phải xác định các thuộc tính của` src` và `font-family`.",
			"scss.lint.hexColorLength.desc": "Mười sáu màu sắc phải bao gồm ba hoặc sáu vị trí thập lục phân.",
			"scss.lint.idSelector.desc": "Thiết bị đã chọn không nên bao gồm ID vì các quy tắc này quá gần với HTML.",
			"scss.lint.ieHack.desc": "IE hack chỉ được yêu cầu khi hỗ trợ các phiên bản IE7 và cũ hơn.",
			"scss.lint.importStatement.desc": "Các câu lệnh nhập sẽ không được tải song song.",
			"scss.lint.important.desc": "Tránh sử dụng '! Quan trọng'.Điều này có nghĩa là toàn bộ việc làm rõ CSS nằm ngoài tầm kiểm soát và đòi hỏi phải tái thiết.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Thuộc tính được bỏ qua vì mối quan hệ hiển thị.Ví dụ: 'display: inline' sẽ tạo ra 'width', 'height', 'margin-top', 'margin-bottom' và 'float' thuộc tính không hợp lệ.",
			"scss.lint.universalSelector.desc": "Được biết, người chọn chung (`*`) là chậm.",
			"scss.lint.unknownAtRules.desc": "Không rõ quy tắc.",
			"scss.lint.unknownProperties.desc": "Thuộc tính không xác định.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Các thuộc tính cụ thể của nhà sản xuất không xác định.",
			"scss.lint.validProperties.desc": "Không có danh sách các thuộc tính được xác minh bằng cách xác minh quy tắc của `UnknownProperies`.",
			"scss.lint.vendorPrefix.desc": "Khi sử dụng tiền tố độc quyền của nhà sản xuất, nó cũng bao gồm các thuộc tính tiêu chuẩn.",
			"scss.lint.zeroUnits.desc": "Không có nhu cầu cho bất kỳ đơn vị.",
			"scss.title": "SCSS (Sass)",
			"scss.validate.desc": "Bật hoặc ngừng tất cả các xác minh.",
			"scss.validate.title": "Kiểm soát xác minh SCSS và các vấn đề nghiêm trọng."
		}
	}
}
